[
  {
    "title": "Was the Quran revealed on the night of 15th Shaban?",
    "body": "<b>Let's explore what the Qur'an says about it.</b><br/><br/><b>Surah No 2: Al-Baqarah - Ayah No 185<br/>شَہۡرُ رَمَضَانَ الَّذِيۡۤ اُنزِلَ فِيۡهِ الۡقُرۡاٰنُ</b><br/>Ramadan is the month in which the Quran was revealed.<br/>This verse makes it clear that the Quran was revealed in Ramadan, not in Shaban or any other month.<br/>Additionally, Allah further mentions about this night:<br/><br/><b>Surah No 44: Ad-Dukhan - Ayah No 3<br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ</b><br/>We sent it down during a blessed night.<br/>Allah emphasizes that the Quran was revealed in a blessed and auspicious night. The entire Surah is dedicated to this night.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 1 <br/>اِنَّاۤ اَنزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/>Indeed, We sent the Qur'an down during the Night of Decree.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 2 <br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/>And what can make you know what is the Night of Decree?<br/><br/> <b>Surah No 97: Al-Qadr - Ayah No 3 <br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/>The Night of Decree is better than a thousand months.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 4 <br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/>The angels and the Spirit descend therein by permission of their Lord for every matter.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/>Peace it is until the emergence of dawn.<br/>This night is described as peaceful and continues until the dawn.<br/> • Qadr refers to destiny, where decisions about fate are made!<br/><br/> In Hadiths, Prophet Muhammad ﷺ has elaborated on this:<br/><br/> <b>Reference Number 1 (Sahih al Bukhari 813):</b><br/><br/>Narrated Abu Salama: Once I went to Abu Said Al-Khudri and asked him, 'Won't you come with us to the date-palm trees to have a talk?' So Abu Said went out and I asked him, 'Tell me what you heard from the Prophet ﷺ about the Night of Qadr.' Abu Said replied, 'Once Allah's Messenger ﷺ performed Itikaf (seclusion in the mosque) on the first ten nights of Ramadan and we did the same with him. Gabriel came to him and said, 'The night you are looking for is ahead of you.' So, the Prophet ﷺ performed the Itikaf in the middle (second) ten days of Ramadan and we too performed Itikaf with him. Gabriel came to him and said, 'The night which you are looking for is ahead of you.' In the morning of the 20th of Ramadan, the Prophet ﷺ delivered a sermon saying, 'Whoever has performed Itikaf with me should continue it. I have been shown the Night of Qadr, but have forgotten its date, but it is in the odd nights of the last ten nights. I saw in my dream that I was prostrating in mud and water.' In those days, the roof of the mosque was made of branches of date-palm trees. At that time, the sky was clear and no cloud was visible, but suddenly, a cloud came and it rained. The Prophet ﷺ led us in the prayer and I saw the traces of mud on the forehead and on the nose of Allah's Messenger ﷺ. So, it was the confirmation of that dream.'<br/><br/> <b>Reference Number 2 (Sahih al Bukhari 2016):</b> <br/><br/>Narrated Abu Salama: I asked Abu Said Al-Khudri, 'Did you hear Allah's Messenger ﷺ talking about the Night of Qadr?' He replied in the affirmative and said, 'Once we were in Itikaf with Allah's Messenger ﷺ in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger ﷺ delivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr but the Divine Order was revoked (Naskh) and it was made to appear in the last ten (nights). So, whoever was in Itikaf with me should stay in Itikaf for the last ten days, for I was informed that I (would be allowed to see) that Night, but the angel who was ordered to stand guard over it, was told (by Allah) not to do so. So, it was made to appear in the last ten nights. And it is a (known) fact that the Night of Qadr is in the last ten, and whoever stays in Itikaf with me should stay in Itikaf for the last ten days.' Then a big basket containing dates was brought to Allah's Messenger ﷺ while he was in Itikaf, and he said to me, 'Open the basket.' I opened the basket and took out some dates and asked, 'Take some of these dates. Would that be sufficient for you?' So, I took the dates to some of the people with me. There were two men sitting with Allah's Messenger ﷺ. (Some Narrators mentioned the names of the two men but I forgot them) Allah's Messenger ﷺ said to them, 'Eat (of these dates), for I do not know but today you may have crossed one or two gardens (in Paradise).'<br/><br/><b>Reference Number 3 (Sahih al Bukhari 2018):</b><br/><br/>Narrated Abu Said Al-Khudri: Allah's Messenger ﷺ used to practice Itikaf in the middle ten days of Ramadan and once he stayed in Itikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his Itikaf. The Prophet ﷺ said, 'Whoever was in Itikaf with me should stay in Itikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water (as a sign). So, whoever was in Itikaf with me should stay for the last ten days.'<br/><br/><b>Reference Number 4 (Sahih Muslim 2769): </b><br/><br/>Abu Sa'id al-Khudri reported that Allah's Messenger (ﷺ) observed Itikaf during the middle ten days of Ramadan. but in the year when he (the Holy Prophet) died he observed Itikaf for twenty days. and in the hadith transmitted by Abu Bakr (the words are): I should strive to observe Itikaf for an odd number of nights, so I stayed in Itikaf for twenty-one nights and Allah's Messenger (ﷺ) died during the twenty-first night. and I could see the signs of disgust on his face on account of what the people (Muslims) had done.<br/><br/><b>Reference Number 5 (Sahih Muslim 2777):</b> <br/><br/>Zirr b. Habaish reported: I said to Ubayy b. Ka'b: Your brother Ibn Mas'ud says: He who passed forty nights (in I'tikaf) (it implies that there is no mention of with the Messenger of Allah (ﷺ) that he observed i'tikaf), and we spent this (period) along with the Messenger of Allah (ﷺ). Thereupon Ubayy b. Ka'b said: He has told the truth. I know the night in which the Messenger of Allah (ﷺ) observed I'tikaf; it is the night on which Allah's Messenger (ﷺ) was commissioned (to His Mission). Allah's Messenger (ﷺ) and his Companions came out and they got down praying towards the south, and they put the tent round them in order to protect themselves against the rain. Allah's Messenger (ﷺ) then led them in the Isha prayer and he observed eight rak'ahs and went to his tent and then led us in the dawn prayer and he then (the narrator said) observed four rak'ahs. (This hadith has been narrated through another chain of transmitters with a slight variation of words: They (the Prophet and his Companions) came out and offered prayer and (again) came out and stood praying and the rain was coming to them from the direction of the feet and heads and they were covered with the drops of rain.)<br/><br/><b>Conclusion:</b><br/><br/>The Quran was revealed in the month of Ramadan, as mentioned in Surah Al-Baqarah (2:185). The Night of Decree (Lailat-ul-Qadr) is described in Surah Al-Qadr (97), emphasizing its significance, better than a thousand months, and angels descending with divine commands during this night. The Hadiths narrated by companions, including Abu Said Al-Khudri and Abu Salama, confirm that Prophet Muhammad ﷺ performed I`tikaf during the last ten nights of Ramadan, searching for the Night of Qadr. The signs include prostration in mud and water, and a dream with indications of the blessed night. Therefore, the odd nights of the last ten days, including the 21st, 23rd, 25th, 27th, and 29th nights, are highlighted for seeking the Night of Decree. The Hadiths reject the claim of the 15th of Shaban being the Night of Qadr. It is crucial to rely on authentic sources and follow the guidance provided in the Quran and Sunnah rather than unfounded claims "
  },
  {
    "title": "Is It Specifically Recommended to Keep Fasting on the 15th of Shaban?",
    "body": "<b>Fasting on the 15th of Shaban is not specifically proven from the Qur'an and authentic Hadiths!</b><br/><br/><b>Therefore, observing voluntary fasts in Shaban is a Sunnah of the Prophet ﷺ! And in this month, deeds are presented before Allah.<br/><br/> <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 1969) :</b><br/><br/> Aisha (may Allah be pleased with her) said: The Messenger of Allah ﷺ used to fast until people said he would never stop fasting, and then he would not fast until people said he would never fast. I never saw the Messenger of Allah ﷺ complete a month of fasting except Ramadan, and I never saw him fast more in any month than he did in Sha'ban.<br/><br/> <b>Reference Number.2 (Sunan Nasai 2359):</b> <br/><br/>Usamah bin Zaid said: I said, 'O Messenger of Allah ﷺ, I do not see you fasting any month as much as Sha'ban.' He said: 'That is a month to which people do not pay much attention, between Rajab and Ramadan. It is a month in which the deeds are taken up to the Lord of the worlds, and I like that my deeds be taken up when I am fasting.'<br/><br/><b>There are other Hadiths as well:<br/>(Sahih Muslim 2721, 2687, 2722)<br/>(Mishkat ul Masabih 2036, 1305)<br/><br/></b> Even the Prophet ﷺ used to fast on Mondays and Thursdays!<br/><br/><b>Reference no.1<br/>(Sahih Muslim 6546)</b> <br/><br/> The Messenger of Allah (ﷺ) said: 'Deeds are presented on every Monday and Thursday, and every believing servant will be forgiven except the one between whom and his brother there is a dispute, and it will be said: 'Leave these two until they reconcile.'<br/><br/>  <b> Reference no. 2<br/>(Tirmidhi 747) </b><br/> Abu Hurairah reported: The Messenger of Allah ﷺ said: 'Deeds are presented on every Monday and Thursday, and I like that my deeds be presented when I am fasting.'<br/> There are other Hadiths supporting this: <br/> (Sahih Muslim 2750)<br/>(Mishkat ul Masabih 2056, 2045) <br/> <br/> So, from these Hadiths, it is evident that the Prophet ﷺ used to observe 11 fasts every month, with 8 of them on Mondays and Thursdays. The remaining 3 are for the 13th, 14th, and 15th of the lunar month.<br/><br/><b>Reference no.1<br/>(Sahih al Bukhari 1975)</b> <br/><br/> The Messenger of Allah ﷺ said:<br/> 'It is sufficient for you to fast three days in a month, for every good deed is multiplied ten times, and that will be like fasting for the whole year.'<br/> Be sure to read the complete Hadith! There are other Hadiths related to this (Sahih Muslim 2744, 2746)<br/>(Mishkat ul Masabih 2046, 2044)<br/>(Nasai 2347)<br/><br/> Conclusion:<br/> Considering all these Hadiths, it is understood that the Prophet ﷺ used to observe 11 fasts every month, but there is no specific evidence for fasting on the 15th of Shaban. Therefore, if you love the Prophet ﷺ, it is recommended to observe these 11 fasts every month or at least the three fasts on the 13th, 14th, and 15th of each lunar month. Any practice not proven from the teachings of the Prophet ﷺ may be considered an innovation and could lead to sin."
  },
  {
    "title": "Does Allah descend to the earthly sky in a special way on the night of 15th Sha'ban and grant forgiveness to people?",
    "body": "<b>According to the Qur'an and Sunnah, we learn that Allah, the Lord of Honor, descends every night in the last portion of the night to the earthly sky and whoever supplicates to Him during that time, He accepts their supplication!</b><br/><br/><b>Reference no.1 (Sahih al Bukhari 1145)</b><br/><br/> The Prophet Muhammad ﷺ said: Our Lord, the Blessed and Exalted, descends every night to the worldly heaven when the last one-third of the night remains. He says: Is there anyone to invoke Me, so that I may respond to his invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?<br/><br/><b>Reference no.2 (Sahih Muslim 1772)</b><br/><br/> Abu-Huraira (R.A) narrated that the Messenger of Allah ﷺ said: The Possessor of Blessings and Highness, our Lord, descends to the worldly sky every night when the last one-third of the night remains. He says: Who is calling upon Me, that I may answer him? Who is asking of Me, that I may give him? Who is seeking My forgiveness, that I may forgive him?<br/><br/><b>Therefore, in these hadiths, the Prophet Muhammad ﷺ clearly explained that Allah descends every night, so singling out a particular night for special worship holds no significance and makes no sense. Such an action would be considered an innovation (bid'ah). Hence, it is advisable to avoid engaging in actions that are not supported by authentic Hadiths. Instead, benefit from this virtue regularly, and base actions on authentic Hadiths rather than mere opinions or traditions.</b>"
  },
  {
    "title": "Is There Extra Reward for Special Worship on the Night of 15th Shaban?",
    "body": "<b>This claim is not substantiated by any Quranic verse or authentic Hadith. Therefore, some popular Hadiths are presented here which are weak, and some are even rejected. Let's take a look:</b><br/><br/><b>∆ Attention: The hadiths mentioned below are weak and not acceptable. They are being presented here only for informational purposes.</b><br/><br/><b>(Claim no.1) Tirmidhi 739 (Weak)</b><br/>Hazrat Aisha (R.A.) narrates that one night I did not find Rasulallah ﷺ in bed. When I went out searching, I saw that he was in the Baqi'a graveyard. He said: Were you afraid that Allah and His Messenger would wrong you? I said: Messenger of Allah! I thought you might have gone to one of your wives. He said: Allah Almighty descends on the fifteenth night of Shaban and forgives the sins of the people more than the hair of the goats of the tribe of Kalb.<br/><br/>Imam Tirmizi states:<b><br/> 1- We only know Aisha's (R.A.) hadith through this chain from Hujjaj.<br/> 2- I heard Muhammad-bin-Ismail Bukhari (the author of Sahih Bukhari) weaken this hadith! He did not hear it from Urwah through Yahya-bin-abi ziyadah and Hujjaj through Yahya-bin-Abi-Ziyadah.</b><br/>This hadith is also found in Mishkat ul Masabih, number 1299, but it is also weak!<br/><br/><b>(Claim no.2) Ibn-e-Majah 1388 (Weak)</b><br/>Hazrat Ali (R.A.) narrated that Rasulallah ﷺ said: When the night of half of Shaban comes, stand in prayer at night and fast during the day. On this night, Allah Almighty descends to the sky before the sun rises and says until it rises: Is there anyone seeking forgiveness, that I may forgive him? Is there anyone seeking provision, that I may provide for him? Is there anyone afflicted, that I may grant him safety?<br/>This hadith is also in Mishkat ul Masabih, number 1308, but it is weak, and it contains a liar narrator, making it unacceptable.<br/><br/><b>(Claim no.3) Ibn-e-Majah 1390 (Weak)</b><br/>Hazrat Abu Musa Ash'ari (RA) narrated that Rasulallah ﷺ said: Allah looks at His servants on the night of half of Shaban, then forgives all the creatures except for a polytheist or one who harbors enmity.<br/>This hadith is also in Mishkat ul Masabih, number 1306, but it is weak.<br/>- It has two unknown narrators (majhool).<br/>- It has two mudallis narrators who are narrating 'an (from) and Imam Muslim mentioned in the introduction to Sahih Muslim that if a mudallis narrates 'an without clarification, it will be considered weak without the clarification of the hearing.<br/><br/><b>Even Sheikh Zubair Ali Zai has declared this hadith in Mishkat as obscured in darkness, and there is no ray of light in it.</b><br/><br/><b>After examining and understanding these false, weak, and fabricated hadiths, it becomes clear that in today's time, these beliefs are widespread, and a considerable number of people believe in these baseless claims. Even some ignorant religious scholars propagate these false hadiths from their pulpits due to lack of knowledge. Therefore, after distinguishing between truth and falsehood, it is essential to distance oneself from falsehood and enlighten others about it!</b>"
  },
  {
    "title": "Should we engage in more virtuous deeds on the night of the 15th of Shaban if our actions are presented to Allah?",
    "body": "Indeed, other hadiths indicate that deeds are presented to Allah during the month of Shaban, such as this Hadith: <br/><br/><b>Sunan Nasai 2359</b><br/>Hazrat Usama bin Zaid (R.A.) narrated that I said to the Prophet ﷺ: 'O Messenger of Allah! I have not seen you observing so many fasts in any other month as you do in Sha'ban.' He replied: 'This is a month to which people do not pay much attention, between Rajab and Ramadan. It is a month in which the deeds are taken up to the Lord of the worlds, and I like that my deeds be taken up when I am fasting.' However, the Prophet ﷺ did not explicitly mention that deeds are presented on the 15th of Shaban. <br/>• Although the Prophet ﷺ mentioned Shaban here, if it were specifically on the 15th, he could have indicated that day, but he did not. <br/>• If indeed deeds are presented only on the 15th of Shaban, then the Prophet ﷺ himself would have been the foremost in engaging in extra deeds on that day. However, this was not the case; the Prophet ﷺ observed fasts throughout the month, and his reason was that deeds are presented to Allah during this month. Thus, it is preferable for us to follow the Prophet ﷺ.<br/><br/>If indeed deeds are presented to Allah, then this presentation occurs twice a day, once during Fajr and again during Asr. <b><br/><br/>Reference no.1<br/>(Sahih al Bukhari 555)</b> The Prophet ﷺ said, 'The duties of the angels shift in turns, and those who are present at night ascend to the heavens. Then Allah asks them, though He knows better than them, 'In what state did you leave My slaves?' They reply, 'When we left them, they were praying, and when we reached them, they were praying.' <b><br/><br/>Reference no.2<br/>(Sahih Muslim 1432)</b> Abu Zinad conveyed that Abu Huraira (R.A) reported: The Prophet ﷺ said: 'The angels who take charge of the night and the angels who take charge of the day are assembled at the time of the Fajr prayer.' Then those who have stayed with you overnight ascend, and Allah asks them, though He knows everything about you, 'In what state did you leave My servants?' They reply, 'When we left them, they were offering the Fajr prayer, and when we reached them, they were offering the Asr prayer.'<br/><br/>From these hadiths, it is evident that deeds are presented during these two times. However, most Muslims pay more attention to these two prayers, especially the Fajr prayer.<br/><br/>If there were any specific deeds allowed on a particular day or night, it would be on Fridays, the leader of days. However, even on Fridays, engaging in specific deeds (not proven by the Prophet ﷺ or his companions) is discouraged. <b><br/><br/>Reference no.1<br/>(Sahih Muslim 2687)</b> Abu Huraira (R.A) reported: The Prophet ﷺ said, 'Do not single out the night of Friday for the prayer of Qiyam and do not single out the day of Friday for fasting, unless it coincides with a fast which one of you observes.'<br/><br/><b>This hadith is also mentioned in Mishkat ul Masabih 2052.</b>"
  },
  {
    "title": "Is it Sunnah to visit the graveyard on the night of 15th Shaban and light candles?",
    "body": "<b>There is no evidence for this in the Qur'an, any authentic hadith, or even in any weak hadith that the Prophet Muhammad ﷺ or any companion specifically went to the graveyard on a particular day and lit candles or incense! Indeed, many righteous individuals have departed from this world during the time of the Prophet ﷺ and the companions, but there is no specific permission or evidence for visiting the graveyard on a special day to light candles or incense! This practice is even associated with Jews and Christians who annually go to their graveyards and light candles, and this action is strongly condemned in the sayings of Prophet Muhammad ﷺ.</b><br/><br/><b>Reference no.1<br/>(Abu Dawood 3512)</b><br/><br/> Abdullah ibn 'Umar said: The Prophet ﷺ said: 'Whoever imitates a people, he is one of them.'<br/><br/><b>Reference no.2<br/>(Sahih Bukhari 7320)</b><br/><br/> Prophet Muhammad ﷺ said, 'You will follow the ways of those nations who were before you, span by span and cubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure (lizard), you would follow them.' We said, 'O Allah's Messenger! (Do you mean) the Jews and the Christians?' He replied, 'Whom else?'<br/><br/>However, visiting the graveyard is indeed a Sunnah of Prophet Muhammad ﷺ and has been commanded. It serves as a reminder of our own mortality!<br/><br/><b>Reference no.2<br/>(Sahih Muslim 976)</b><br/><br/>Narrated by Hazrat Huraira (RA): The Prophet ﷺ visited the grave of his mother, wept, and caused others around him to weep. Then he said: 'I sought permission from my Lord to seek forgiveness for her, but it was not granted. I then sought permission to visit her grave, and I was granted permission. Therefore, visit the graves, for they remind you of death.'<br/><br/><b>So, it is advisable to visit the graveyard every week or at least once a month, remember one's own death, and derive lessons from it. However, designating only one day in the year for a special visit and making supplications for loved ones is incorrect. Instead, one should engage in righteous deeds daily, as Allah appreciates consistent small acts over grand gestures. Lighting candles or incense in the graveyard is not prescribed. Imitating the practices of Jews and Christians in this regard is unnecessary and can lead to sinful behavior.</b>And even in one Hadith, it is mentioned that the Prophet Muhammad ﷺ invoked a curse (la'nat, meaning being deprived of all goodness) upon such individuals.<br/><b>Reference no.1<br/>(Musnad Ahmad 3348)</b><br/>Hazrat Abdullah ibn Abbas (RA) narrated that the Messenger of Allah (SAW) invoked a curse upon women who visit graves frequently, those who turn graves into mosques, and those who light lamps on graves"
  },
  {
    "title": "Is it a Sunnah to specifically make sweet dishes like halwa on the day of 15th Shaban?",
    "body": "<b>Some people believe that on this day, the blessed teeth of Prophet Muhammad ﷺ were martyred, and he was served halwa. <br/><br/>However, this belief is entirely false and baseless. The reality is that the incident of the martyrdom of the Prophet's ﷺ blessed teeth occurred during the Battle of Uhud in Shawwal of the third Hijri, not in Shaban. There is no authentic Hadith supporting the claim that halwa was served to him on that day, and there is no weak Hadith either. These are all unfounded claims.<br/><br/>There is also a story circulated that Owais Qarni, a Tabi'i (follower of the companions), broke all his teeth out of love for the Prophet ﷺ, and then halwa came from heaven for him. But this story is also completely false and baseless, with no justification found in any authentic Hadith.<br/><br/>Even if, for the sake of argument, this false story is accepted, the conclusion is that those who are nowadays making and eating halwa with intact teeth should break their teeth first and then eat halwa to follow the supposed Sunnah of Owais Qarni. However, this argument is absurd, and there is no basis for such beliefs.<br/><br/>Therefore, it is foolish to engage in debates based on false narratives, and no fruitful results come out of it, except for the fact that these stories are untrue!<br/><br/>It is astonishing that some mosque imams propagate such ignorant tales from their pulpits. They should rectify their knowledge. Some preachers may do so just for the pleasure of receiving halwa on this day, but they should fear Allah because spreading false stories may provide enjoyment in this world, but in the hereafter, only punishment awaits. Therefore, one should abandon such futile activities and adhere to the true teachings of the religion.</b>"
  },
  {
    "title": "What is Bid'ah? And why Shab-e-Barat is Comes under Bid'ah!!",
    "body": "<b>The root of the word bid’ah in Arabic means initiating something without any precedent.</b><br/> In the terminology of Shari’ah, bid’ah means something that has been introduced into the religion of Allah that has no general or specific basis to support it.<br/><br/>Also there's a famous Hadith regarding this topic:<br/><br/>The Prophet Muhammad ﷺ Said :The best of the speech is emboided in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations and every innovation is error. <br/><br/><b> Sahih Muslim 867a <br/>    Sunan Nasai 1578</b><br/> <br/> From this Hadith we come to know that Innovations leads a man astray , and all those who are astrayed will be ending up in the fire Now the question arises what is the innovation the prophet Muhammad ﷺ talking about ?Is it regarding cars, buses , ipad ?<br/> No!<br/> He meant those affairs, rituals , belief which people will add to the faith of Islam (after the prophet) <br/><br/>Since we are talking in the context of the Month Of Shab'aan I would like to highlight that we shall Highlight Bida'h in this month <br/><br/>How can we define what will be defined as a biddah ?<br/> Let me clear this with an example <br/> Suppose Tomorrow Some Muslim Agree To Add A NEW NAMAZ in the daily five prayers <br/>Ex A Congregational prayer at 10 am SHARP and they start giving Azaan for it in the mosque , so now I ask you this question whether it would be accepted by Allah or not ?<br/>Why this won't be a good thing ?<br/> Now People have increased the number of prostrations , so why is it not a good thing ?<br/>The Reason is simple - <br/>The prophet Muhammad ﷺ him didn't do it So we derive a principle from it In all of the divine matters Such as praying, fasting A Daleel is required , otherwise it(divine matters) is rejected And for All of the worldly matters Such as Car phone their status is that they are permissible to use as long as there is no Daleel to confirm its prohibition <br/><b>Daleel = Qur'an + Sahih Hadith</b><br/> <b>So analogically we deduct that Making a day special ( 15 shaban for eg ) for worship Was not practiced by the prophet Muhammad ﷺ Rather the sunnah is to fast on the white days Ayyam Al Beedh 13 14 15 of the lunar month And Allah Knows Best</b> <br/> <b>May Allah Guide Us.Allahumma ameen</b>"
  }
]
