[
  {
    "title": "Was the Quran revealed on the night of 15th Shaban?",
    "body": "<b>Let's explore what the Qur'an says about it.</b><br/><br/><b>Surah No 2: Al-Baqarah - Ayah No 185<br/>شَہۡرُ رَمَضَانَ الَّذِيۡۤ اُنزِلَ فِيۡهِ الۡقُرۡاٰنُ</b><br/>Ramadan is the month in which the Quran was revealed.<br/>This verse makes it clear that the Quran was revealed in Ramadan, not in Shaban or any other month.<br/>Additionally, Allah further mentions about this night:<br/><br/><b>Surah No 44: Ad-Dukhan - Ayah No 3<br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ</b><br/>We sent it down during a blessed night.<br/>Allah emphasizes that the Quran was revealed in a blessed and auspicious night. The entire Surah is dedicated to this night.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 1 <br/>اِنَّاۤ اَنزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/>Indeed, We sent the Qur'an down during the Night of Decree.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 2 <br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/>And what can make you know what is the Night of Decree?<br/><br/> <b>Surah No 97: Al-Qadr - Ayah No 3 <br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/>The Night of Decree is better than a thousand months.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 4 <br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/>The angels and the Spirit descend therein by permission of their Lord for every matter.<br/><br/><b>Surah No 97: Al-Qadr - Ayah No 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/>Peace it is until the emergence of dawn.<br/>This night is described as peaceful and continues until the dawn.<br/> • Qadr refers to destiny, where decisions about fate are made!<br/><br/> In Hadiths, Prophet Muhammad ﷺ has elaborated on this:<br/><br/> <b>Reference Number 1 (Sahih al Bukhari 813):</b><br/><br/>Narrated Abu Salama: Once I went to Abu Said Al-Khudri and asked him, 'Won't you come with us to the date-palm trees to have a talk?' So Abu Said went out and I asked him, 'Tell me what you heard from the Prophet ﷺ about the Night of Qadr.' Abu Said replied, 'Once Allah's Messenger ﷺ performed Itikaf (seclusion in the mosque) on the first ten nights of Ramadan and we did the same with him. Gabriel came to him and said, 'The night you are looking for is ahead of you.' So, the Prophet ﷺ performed the Itikaf in the middle (second) ten days of Ramadan and we too performed Itikaf with him. Gabriel came to him and said, 'The night which you are looking for is ahead of you.' In the morning of the 20th of Ramadan, the Prophet ﷺ delivered a sermon saying, 'Whoever has performed Itikaf with me should continue it. I have been shown the Night of Qadr, but have forgotten its date, but it is in the odd nights of the last ten nights. I saw in my dream that I was prostrating in mud and water.' In those days, the roof of the mosque was made of branches of date-palm trees. At that time, the sky was clear and no cloud was visible, but suddenly, a cloud came and it rained. The Prophet ﷺ led us in the prayer and I saw the traces of mud on the forehead and on the nose of Allah's Messenger ﷺ. So, it was the confirmation of that dream.'<br/><br/> <b>Reference Number 2 (Sahih al Bukhari 2016):</b> <br/><br/>Narrated Abu Salama: I asked Abu Said Al-Khudri, 'Did you hear Allah's Messenger ﷺ talking about the Night of Qadr?' He replied in the affirmative and said, 'Once we were in Itikaf with Allah's Messenger ﷺ in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger ﷺ delivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr but the Divine Order was revoked (Naskh) and it was made to appear in the last ten (nights). So, whoever was in Itikaf with me should stay in Itikaf for the last ten days, for I was informed that I (would be allowed to see) that Night, but the angel who was ordered to stand guard over it, was told (by Allah) not to do so. So, it was made to appear in the last ten nights. And it is a (known) fact that the Night of Qadr is in the last ten, and whoever stays in Itikaf with me should stay in Itikaf for the last ten days.' Then a big basket containing dates was brought to Allah's Messenger ﷺ while he was in Itikaf, and he said to me, 'Open the basket.' I opened the basket and took out some dates and asked, 'Take some of these dates. Would that be sufficient for you?' So, I took the dates to some of the people with me. There were two men sitting with Allah's Messenger ﷺ. (Some Narrators mentioned the names of the two men but I forgot them) Allah's Messenger ﷺ said to them, 'Eat (of these dates), for I do not know but today you may have crossed one or two gardens (in Paradise).'<br/><br/><b>Reference Number 3 (Sahih al Bukhari 2018):</b><br/><br/>Narrated Abu Said Al-Khudri: Allah's Messenger ﷺ used to practice Itikaf in the middle ten days of Ramadan and once he stayed in Itikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his Itikaf. The Prophet ﷺ said, 'Whoever was in Itikaf with me should stay in Itikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water (as a sign). So, whoever was in Itikaf with me should stay for the last ten days.'<br/><br/><b>Reference Number 4 (Sahih Muslim 2769): </b><br/><br/>Abu Sa'id al-Khudri reported that Allah's Messenger (ﷺ) observed Itikaf during the middle ten days of Ramadan. but in the year when he (the Holy Prophet) died he observed Itikaf for twenty days. and in the hadith transmitted by Abu Bakr (the words are): I should strive to observe Itikaf for an odd number of nights, so I stayed in Itikaf for twenty-one nights and Allah's Messenger (ﷺ) died during the twenty-first night. and I could see the signs of disgust on his face on account of what the people (Muslims) had done.<br/><br/><b>Reference Number 5 (Sahih Muslim 2777):</b> <br/><br/>Zirr b. Habaish reported: I said to Ubayy b. Ka'b: Your brother Ibn Mas'ud says: He who passed forty nights (in I'tikaf) (it implies that there is no mention of with the Messenger of Allah (ﷺ) that he observed i'tikaf), and we spent this (period) along with the Messenger of Allah (ﷺ). Thereupon Ubayy b. Ka'b said: He has told the truth. I know the night in which the Messenger of Allah (ﷺ) observed I'tikaf; it is the night on which Allah's Messenger (ﷺ) was commissioned (to His Mission). Allah's Messenger (ﷺ) and his Companions came out and they got down praying towards the south, and they put the tent round them in order to protect themselves against the rain. Allah's Messenger (ﷺ) then led them in the Isha prayer and he observed eight rak'ahs and went to his tent and then led us in the dawn prayer and he then (the narrator said) observed four rak'ahs. (This hadith has been narrated through another chain of transmitters with a slight variation of words: They (the Prophet and his Companions) came out and offered prayer and (again) came out and stood praying and the rain was coming to them from the direction of the feet and heads and they were covered with the drops of rain.)<br/><br/><b>Conclusion:</b><br/><br/>The Quran was revealed in the month of Ramadan, as mentioned in Surah Al-Baqarah (2:185). The Night of Decree (Lailat-ul-Qadr) is described in Surah Al-Qadr (97), emphasizing its significance, better than a thousand months, and angels descending with divine commands during this night. The Hadiths narrated by companions, including Abu Said Al-Khudri and Abu Salama, confirm that Prophet Muhammad ﷺ performed I`tikaf during the last ten nights of Ramadan, searching for the Night of Qadr. The signs include prostration in mud and water, and a dream with indications of the blessed night. Therefore, the odd nights of the last ten days, including the 21st, 23rd, 25th, 27th, and 29th nights, are highlighted for seeking the Night of Decree. The Hadiths reject the claim of the 15th of Shaban being the Night of Qadr. It is crucial to rely on authentic sources and follow the guidance provided in the Quran and Sunnah rather than unfounded claims "
  },
  {
    "title": "Is It Specifically Recommended to Keep Fasting on the 15th of Shaban?",
    "body": "<b>Fasting on the 15th of Shaban is not specifically proven from the Qur'an and authentic Hadiths!</b><br/><br/><b>Therefore, observing voluntary fasts in Shaban is a Sunnah of the Prophet ﷺ! And in this month, deeds are presented before Allah.<br/><br/> <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 1969) :</b><br/><br/> Aisha (may Allah be pleased with her) said: The Messenger of Allah ﷺ used to fast until people said he would never stop fasting, and then he would not fast until people said he would never fast. I never saw the Messenger of Allah ﷺ complete a month of fasting except Ramadan, and I never saw him fast more in any month than he did in Sha'ban.<br/><br/> <b>Reference Number.2 (Sunan Nasai 2359):</b> <br/><br/>Usamah bin Zaid said: I said, 'O Messenger of Allah ﷺ, I do not see you fasting any month as much as Sha'ban.' He said: 'That is a month to which people do not pay much attention, between Rajab and Ramadan. It is a month in which the deeds are taken up to the Lord of the worlds, and I like that my deeds be taken up when I am fasting.'<br/><br/><b>There are other Hadiths as well:<br/>(Sahih Muslim 2721, 2687, 2722)<br/>(Mishkat ul Masabih 2036, 1305)<br/><br/></b> Even the Prophet ﷺ used to fast on Mondays and Thursdays!<br/><br/><b>Reference no.1<br/>(Sahih Muslim 6546)</b> <br/><br/> The Messenger of Allah (ﷺ) said: 'Deeds are presented on every Monday and Thursday, and every believing servant will be forgiven except the one between whom and his brother there is a dispute, and it will be said: 'Leave these two until they reconcile.'<br/><br/>  <b> Reference no. 2<br/>(Tirmidhi 747) </b><br/> Abu Hurairah reported: The Messenger of Allah ﷺ said: 'Deeds are presented on every Monday and Thursday, and I like that my deeds be presented when I am fasting.'<br/> There are other Hadiths supporting this: <br/> (Sahih Muslim 2750)<br/>(Mishkat ul Masabih 2056, 2045) <br/> <br/> So, from these Hadiths, it is evident that the Prophet ﷺ used to observe 11 fasts every month, with 8 of them on Mondays and Thursdays. The remaining 3 are for the 13th, 14th, and 15th of the lunar month.<br/><br/><b>Reference no.1<br/>(Sahih al Bukhari 1975)</b> <br/><br/> The Messenger of Allah ﷺ said:<br/> 'It is sufficient for you to fast three days in a month, for every good deed is multiplied ten times, and that will be like fasting for the whole year.'<br/> Be sure to read the complete Hadith! There are other Hadiths related to this (Sahih Muslim 2744, 2746)<br/>(Mishkat ul Masabih 2046, 2044)<br/>(Nasai 2347)<br/><br/> Conclusion:<br/> Considering all these Hadiths, it is understood that the Prophet ﷺ used to observe 11 fasts every month, but there is no specific evidence for fasting on the 15th of Shaban. Therefore, if you love the Prophet ﷺ, it is recommended to observe these 11 fasts every month or at least the three fasts on the 13th, 14th, and 15th of each lunar month. Any practice not proven from the teachings of the Prophet ﷺ may be considered an innovation and could lead to sin."
  },
  {
    "title": "Does Allah descend to the earthly sky in a special way on the night of 15th Sha'ban and grant forgiveness to people?",
    "body": "<b>According to the Qur'an and Sunnah, we learn that Allah, the Lord of Honor, descends every night in the last portion of the night to the earthly sky and whoever supplicates to Him during that time, He accepts their supplication!</b><br/><br/><b>Reference no.1 (Sahih al Bukhari 1145)</b><br/><br/> The Prophet Muhammad ﷺ said: Our Lord, the Blessed and Exalted, descends every night to the worldly heaven when the last one-third of the night remains. He says: Is there anyone to invoke Me, so that I may respond to his invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?<br/><br/><b>Reference no.2 (Sahih Muslim 1772)</b><br/><br/> Abu-Huraira (R.A) narrated that the Messenger of Allah ﷺ said: The Possessor of Blessings and Highness, our Lord, descends to the worldly sky every night when the last one-third of the night remains. He says: Who is calling upon Me, that I may answer him? Who is asking of Me, that I may give him? Who is seeking My forgiveness, that I may forgive him?<br/><br/><b>Therefore, in these hadiths, the Prophet Muhammad ﷺ clearly explained that Allah descends every night, so singling out a particular night for special worship holds no significance and makes no sense. Such an action would be considered an innovation (bid'ah). Hence, it is advisable to avoid engaging in actions that are not supported by authentic Hadiths. Instead, benefit from this virtue regularly, and base actions on authentic Hadiths rather than mere opinions or traditions.</b>"
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah duniya ke akhri aasmaan pe aata hai aur logon ki farmata hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko khaas taur se zyada ibadat karne ka zyada sawaab hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ko khaas taur se halwa bnana aur sbko khilana sunnat se sabit hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya iss raat naama-e-amaal Allah k huzur pesh hote hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "What is innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Why is celebrating Shab-e-Baraat an innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  }
]
