[
  {
    "title": "प्रश्न 1: क्या कुरान, 15 शाबान की रात को नाज़िल हुआ था?",
    "body": "<b>चलो देखते हैं कि क़ुरान में इसके बारे में क्या कहा गया है:</b><br/><br/><b>सूरह नंबर 2: अल-बक़राह - आयत नंबर 185<br/>شَہۡرُ رَمَضَانَ الَّذِيۡۤ اُنزِلَ فِيۡهِ الۡقُرۡاٰنُ</b><br/>रमज़ान वो माह है जिसमें क़ुरान उतारा गया था।<br/>Tयह आयत दिखाती है कि क़ुरान रमज़ान में उतारा गया था, न कि शबान या किसी अन्य माह में।<br/>इसके अतिरिक्त, अल्लाह ने इस रात के बारे में कहा है:<br/><br/><b>सूरह नंबर 44: अद-दुखान - आयत नंबर 3<br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ</b><br/>हमने उसे [क़ुरान] एक मुबारक रात में उतारा।<br/>और अल्लाह ने क़ुरान में इस रात का जिक्र किया है; वास्तव में, एक पूरी सूरह का नाम उस पर है।<br/><br/><b>सूरह नंबर 97: अल-क़द्र - आयत नंबर 1<br/>اِنَّاۤ اَنزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/>बेशक, हमने क़ुरान को क़दर की रात में उतारा।<br/><br/><b>सूरह नंबर 97: अल-क़द्र - आयत नंबर 2<br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/>और तुम्हें क्या पता है कि क्या है क़दर की रात?<br/><br/> <b>सूरह नंबर 97: अल-क़द्र - आयत नंबर 3<br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/>क़दर की रात हज़ार महीनों से बेहतर है।<br/><br/><b>सूरह नंबर 97: अल-क़द्र - आयत नंबर 4<br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/>हर बात के लिए अपने रब की इजाज़त से वहां पर मलाइका और रूह उतरते हैं।<br/><br/><b>सूरह नंबर 97: अल-क़द्र - आयत नंबर 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/>फ़ज़ा वह रात को सुबह की आमद तक है।.<br/>क़द्र भाग्य को सूचित करता है, जिसमें निर्णय लिया जाता है!<br/><br/> हदीस में, रसूलल्लाह  मुहम्मद ﷺ ने इसके बारे में संक्षेप में बताया है:<br/><br/> <b>सन्दर्भ क्रमांक 1 <br/> साहिह बुखारी 813</b><br/><br/>मैं अबू-सईद ख़ुदरी (रज़ि०) की ख़िदमत में हाज़िर हुआ। मैंने कहा कि फ़ुलाँ नख़लिस्तान मैं क्यों न चलें सैर भी करेंगे और कुछ बातें भी करेंगे। चुनांचे आप तशरीफ़ ले चले। अबू-सलमा ने बयान किया कि मैंने राह में कहा कि शबे-क़द्र से मुताल्लिक़ आप ने अगर कुछ नबी करीम (सल्ल०) से सुना है तो उसे बयान कीजिये। उन्होंने कहा कि नबी करीम (सल्ल०) ने रमज़ान के पहले अशरे (दशक) मैं ऐतिकाफ़ किया और हम भी आप के साथ ऐतिकाफ़ मैं बैठ गए  लेकिन जिब्राईल (अलैहि०) ने आ कर बताया कि आप जिसकी तलाश में हैं (शबे-क़द्र) वो आगे है। चुनांचे आप ने दूसरे अशरे (दशक) मैं भी ऐतिकाफ़ किया और आप के साथ हमने भी। जिब्राईल (अलैहि०) दोबारा आए और फ़रमाया कि आप जिसकी तलाश में हैं वो (रात) आगे है। फिर आप ने बीसवीं रमज़ान की सुबह को ख़ुतबा दिया। आप ने फ़रमाया कि जिसने मेरे साथ ऐतिकाफ़ किया हो वो दोबारा करे। क्योंकि शबे-क़द्र मुझे मालूम हो गई लेकिन मैं भूल गया और वो आख़िरी अशरे की ताक़ रातों में है और मैंने ख़ुद को कीचड़ मैं सजदा करते देखा। मस्जिद की छत खजूर की डालियों की थी। आसमान बिल्कुल साफ़ था कि इतने में एक पतला सा बादल का टुकड़ा आया और बरसने लगा। फिर नबी करीम (सल्ल०) ने हमको नमाज़ पढ़ाई और मैंने रसूलुल्लाह (सल्ल०) की पेशानी और नाक पर कीचड़ का असर देखा। आपका ख़्वाब सच्चा हो गया।<br/><br/> <b>सन्दर्भ क्रमांक 2 <br/>साहिह बुखारी 2016</b> <br/><br/>हम नबी करीम (सल्ल०) के साथ रमज़ान के बीच के दस दिनों में ऐतिकाफ़ मैं बैठे। फिर बीसवी तारीख़ की सुबह को नबी करीम (सल्ल०) ऐतिकाफ़ से निकले और हमें ख़ुतबा दिया, आप (सल्ल०) ने फ़रमाया कि मुझे शबे-क़द्र दिखाई गई  लेकिन भुला दी गई या (आपने ये फ़रमाया कि) मैं ख़ुद भूल गया। इसलिये तुम उसे आख़िरी दस ताक़ रातों में तलाश करो। मैंने ये भी देखा है (ख़्वाब में) कि मानो मैं कीचड़ मैं सजदा कर रहा हूँ। इसलिये जिसने मेरे साथ ऐतिकाफ़ किया हो वो फिर लौट आए और ऐतिकाफ़ मैं बैठे। ख़ैर हमने फिर ऐतिकाफ़ किया। उस वक़्त आसमान पर बादलों का एक टुकड़ा भी नहीं था। लेकिन देखते ही देखते बादल आए और बारिश इतनी हुई कि मस्जिद की छत से पानी टपकने लगा जो खजूर की शाख़ों से बनी हुई थी। फिर नमाज़ की तकबीर हुई तो मैंने देखा कि रसूलुल्लाह (सल्ल०) कीचड़ मैं सजदा कर रहे थे। यहाँ तक कि कीचड़ का निशान मैंने आप (सल्ल०) की पेशानी पर देखा।<br/><br/><b>सन्दर्भ क्रमांक 3 <br/>सही बुखारी 2018</b><br/><br/>नबी करीम (सल्ल०) रमज़ान के बीच के दस दिनों में ऐतिकाफ़ किया करते थे। बीस रातों के गुज़र जाने के बाद जब इक्कीसवीं तारीख़ की रात आती तो शाम को आप घर वापस आ जाते। जो लोग आपके साथ ऐतिकाफ़ मैं होते वो भी अपने घरों में वापस आ जाते। एक रमज़ान में आप जब ऐतिकाफ़ किये हुए थे, तो उस रात में भी (मस्जिद ही में) मुक़ीम रहे जिसमें आपकी आदत घर आ जाने की थी। फिर आपने लोगों को ख़ुतबा दिया और जो कुछ अल्लाह पाक ने चाहा  आपने लोगों को उसका हुक्म दिया, फिर फ़रमाया कि मैं इस (दूसरे) दस मैं ऐतिकाफ़ किया करता था  लेकिन अब मुझ पर ये वाज़ेह हुआ है कि मैं आख़िरी दस दिनों में ऐतिकाफ़ करूँ। इसलिये जिसने मेरे साथ ऐतिकाफ़ किया है वो अपने एतिकाफ़ मैं ही रहे और मुझे इस रात (शबे-क़द्र) दिखाई, गई लेकिन फिर भुलवा दी गई। इसलिये तुम लोग उसे आख़िरी दस रातों में तलाश करो। मैंने (ख़्वाब में) देखा कि मैं पानी और मिटटी मैं सजदा कर रहा हूँ। उस रात आसमान पर बादल हुआ और बारिश बरसी  नबी करीम (सल्ल०) के नमाज़ पढ़ने की जगह (छत से) पानी टपकने लगा। ये इक्कीसवीं रात कि बात है। मैंने ख़ुद अपनी आँखों से देखा कि आप (सल्ल०) सुबह की नमाज़ के बाद वापस हो रहे थे। और आपके चेहरा मुबारक पर कीचड़ लगी हुई थी। <br/> <br/> <b> इन कुरानी आयतों की सार्थकता से प्रकट होता है कि लैलतुल क़द्र, यानी तक़दीर की रात, वास्तव में रमज़ान में होती है, और विशेष रूप से उसके अंतिम दस रातों में। यह तथ्य वास्तविक हदीसों द्वारा सत्यापित है, जो बताती है कि लैलतुल क़द्र किसी भी विषम रात में हो सकती है जो रमज़ान के अंतिम दस रातों में होती है (21वीं, 23वीं, 25वीं, 27वीं या 29वीं)। शबान की 15 वीं को लैलतुल क़द्र के रूप में घोषित करना पूरी तरह से असार और किसी भी कुरानी या सुन्नी साक्ष्य से समर्थित नहीं है। यह केवल एक कल्पित धारणा है जिसमें कोई इस्लामी आधार नहीं है </b>"
  },
  {
    "title": "क्या 15 शबान को ख़ास तौर से रोज़ा रखना सुन्नत से साबित है?",
    "body": "<b>15 शबान के दिन ख़ास तौर से रोज़ा रखना क़ुरआन और सहीह उल इंसाद हदीस से साबित नहीं है!</b><br/><br/><b>लिहाज़ा शबान में नफली रोज़े रखना सुन्नत-ए-रसूलअल्लाह ﷺ है! और इस महीने में भी नमाएअमल अल्लाह के हुज़ूर पेश होते हैं!<br/><br/><br/><b>संदर्भ संख्या.1 (सहीह अल बुखारी 1969):</b><br/><br/> आइशा र.अ. ने कहा: अल्लाह के रसूल ﷺ रोजे रखते थे जब तक लोग यह न कहें कि वह कभी रोज़ा नहीं छोड़ेंगे, फिर उन्होंने रोज़े छोड़ दिए जब तक लोग यह न कहें कि वह कभी रोज़ा नहीं रखेंगे। मैंने कभी नहीं देखा कि अल्लाह के रसूल ﷺ किसी महीने में पूरा महीना रोज़ा रखते, सिवाए रमजान के, और उन्हें किसी और महीने में इतना रोज़ा नहीं रखते थे जितना शाबान में रखते थे।<br/><br/> <b>संदर्भ संख्या.2 (सुनन नसाई 2359):</b> <br/><br/> उसमाह बिन ज़ैद ने कहा: 'अरे अल्लाह के रसूल ﷺ, मैंने आपको शाबान के किसी भी महीने इतना रोज़ा नहीं रखते देखा, उन्होंने कहा: यह एक ऐसा महीना है जिसे लोग ज़्यादा ध्यान नहीं देते, रजब और रमजान के बीच में। यह एक महीना है जिसमें अमल अल्लाह तआला तक पहुंचाए जाते हैं, और मुझे पसंद है कि मेरे अमल रोज़े में ले जाए जाए जब मैं रोज़ा रखता हूँ।<br/><br/><b>और भी दीगर हदीसें हैं<br/>(सहीह मुस्लिम 2721,2687,2722)<br/>(मिशकातुल मसाबीह 2036,1305)<br/><br/></b> इसके अलावा रसूलअल्लाह ﷺ हर मंगलवार और जुमेरात को रोज़ा रखते थे!<br/><br/><b>संदर्भ संख्या.1<br/>(सहीह मुस्लिम 6546)</b> <br/><br/> अल्लाह के रसूल (ﷺ) ने फरमाया: लोगों के अमल हर हफ्ते दो दिनों को पेश किए जाते हैं, यानी मंगलवार और जुमेरात, और हर ईमानवाला बंदा बख्शीश पाएगा, सिवाए उस बंदे के जिसके दिल में उसके भाई के खिलाफ दुश्मनी हो, और उससे कहा जाएगा: उन्हें छोड़ दो और उन्हें तब ताल दो जब तक वह सुलह हो जाए। <br/><br/>  <b>संदर्भ संख्या. 2<br/>(तिर्मिज़ी 747) </b><br/> अबू हुरैरह ने बयान किया कि: रसूलअल्लाह ﷺ ने फरमाया: आमाल मंगलवार और जुमेरात को पेश किए जाते हैं, और मैं चाहता हूँ कि मेरे अमल तब पेश किए जाएँ जब मैं रोज़ा रखता हूँ। <br/> और भी दीगर हदीसों में यह बात रिकॉर्ड हुई है: <br/> (सहीह मुस्लिम 2750)<br/>(मिशकातुल मसाबीह 2056,2045) <br/> <br/> तो इन सभी हदीसों से पता चला कि रसूलअल्लाह ﷺ 11 रोज़े तो हर महीने में रखते थे, 8 तो हो गए ये मंडे और थर्सडे के। और बाकी 3 अय्याम अल बीद के <br/><br/><b>संदर्भ संख्या.1<br/>(सहीह अल बुखारी 1975)</b> <br/><br/> रसूलअल्लाह ﷺ ने कहा <br/>तुम्हारे लिए, महीने में तीन दिन रोज़ा रखना काफ़ी है, क्योंकि अच्छे कामों का सवाब दस गुना बढ़ जाता है, इसलिए यह साल भर के रोज़े रखने के बराबर होगा। पूरी हदीस ज़रूर पढ़ें! और भी दीगर हदीसें हैं इससे संबंधित (सहीह मुस्लिम 2744,2746)<br/>(मिशकातुल मसाबीह 2046,2044)<br/>(नसाई 2347)<br/><br/> निष्कर्ष:<br/> इन सभी हदीसों को नज़र रखते हुए यही मफ़हूम निकलता है कि रसूलअल्लाह ﷺ हर महीने 11 रोज़े रखते थे लेकिन ख़ास तौर से 15 शबान के दिन रोज़ा रखना किसी भी सहीह हदीस से साबित नहीं है लिहाज़ा अगर आपको रसूलअल्लाह ﷺ से मोहब्बत है तो ये 11 रोज़े हर महीने या अत्लीस्ट 3 रोज़े अय्याम अल बीद के हर महीने ज़रूर रखा करें और जो अमल रसूलअल्लाह ﷺ से साबित नहीं है तो वह अमल बिद'आह में शुमार होगा और इससे आप गुनाहगार भी होंगे!"
  },
  {
    "title": "क्या अल्लाह 15 शबान की रात को ख़ास तौर से आसमान-ए-दुनिया पर नुज़ूल फरमाता है और लोगों की माग़फ़िरत करता है?",
    "body": "<b>क़ुरआन और सुन्नत के अनुसार, हमें यही बात पता चलती है कि अल्लाह, रब्बुल इज्ज़त, हर रात के आख़िरी हिस्से में आसमान-ए-दुनिया पर नुज़ूल फरमाता है और जो उससे दुआ करता है, वह उसे क़बूल करता है!</b><br/><br/><b>संदर्भ संख्या.1 (सहीह अल बुखारी 1145)</b><br/><br/> रसूलअल्लाह ﷺ ने कहा: हमारा परवर्दिगार बुलंद बरकत वाला है हर रात को उस वक्त आता है जब रात का आख़िरी तिहाई हिस्सा रह जाता है। वह कहता है कोई मुझसे दुआ करने वाला है कि मैं उसकी दुआ क़बूल करूँ, कोई मुझसे मांगने वाला है कि मैं उसे दूँ, कोई मुझसे बख्शिश तलाब करने वाला है कि मैं उसे बख्श दूँ।<br/><br/><b>संदर्भ संख्या.2 (सहीह मुस्लिम 1772)</b><br/><br/> अबु-हुरैरह (र.अ.) से रिवायत की कि रसूलअल्लाह ﷺ ने कहा: बरकत और बुलंदी का मालिक हमारा रब, *हर रात को जब रात का आख़िरी तिहाई हिस्सा बाक़ी रह जाता है, (तो) दुनिया के आसमान पर नुज़ूल फरमाता है। और कहता है: कौन मुझे पुकारता है कि मैं उसकी पुकार को सुनूँ? कौन मुझ से मांगता है कि मैं उसको दूँ, और कौन मुझ से बख्शिश तलाब करता है कि मैं उसे बख्श दूँ? <br/><br/><b>इसलिए, इन हदीसों में रसूलअल्लाह ﷺ ने स्पष्ट रूप से बता दिया कि अल्लाह हर रात नुज़ूल करता है, इसलिए किसी विशेष रात को विशेष इबादत के लिए अलग करना कोई मतकब नहीं बनता और कोई सेंस नहीं बनता, और ऐसा कार्य बिदअत में शुमार होगा! इसलिए, जो काम रोज़ाना हो रहा है तो उस काम को किसी दिन या किसी रात को ख़ास कर लेना बेशक एक बेवकूफी है! तो इस काम से बचें और जब चाहे रोज़ाना इस फ़ज़ीलत से फ़ायदा उठाएं और लोगों की बातों पर नहीं सहीह हदीस पे आमल करें!</b>"
  }
]
