[
  {
    "title": "Kya 15 Shaban ki raaat ko quran naazil hua tha?",
    "body": " <b>Aaiye jaane ki Qur'an iske baare me kya kehta hai?</b><br/><br/><b>Surat No 2 : سورة البقرة - Ayat No 185<br/> شَہۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡہِ الۡقُرۡاٰنُ </b><br/> Ramzan woh mahina hai jisme Quran utara gaya <br/> Iss Ayat se pata chala k Qur'an, shaban ya aur kisi mahine me nhi balki ramadan me hi nazil hona shuru Hua hai! <br/>Aur mazeed iss raat k baare me Allah ne farmaya:<br/><br/><b>Surat No 44 : سورة الدخان - Ayat No 3 <br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ </b><br/>Hamne ise ek badi khaair aur barkatwali raat mein utara hai<br/> Aur mazeed Allah ne Qur'an me hi uss raat ka bhi zikr kr diya hai balki puri surah hi uss raat k naam pe hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 1 <br/>اِنَّاۤ اَنۡزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/> Humne is (Qur'an) ko Shabe-Qadr mein nazil kiya hai.<br/><br/><b>Surat No 97 : سورة القدر - Ayat No 2 <br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/> Aur tum kya jaano ki Shabe-Qadr kya hai?<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 3 <br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/> Shabe-Qadr hazaar mahinon se zyada behtar hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 4 <br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/> Farishte aur rooh usmein apne Rab ke izn se har hukm lekar utarte hain. <br/><br/><b>Surat No 97 : سورة القدر - Ayat No 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/> Vo raat saraasar salaamati hai, Tulu-e-Fajr tak.<br/> • Qadr kehte hi destiny ko hai, jisme takdeer ke faisle hote hai!<br/><br/> Hadiths me rasulallah ﷺ ne iske baare me aur briefly bataya hai: <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 813) :</b><br/><br/>Narrated Abu Salama: Ek baar main Abu Sa`id Al-Khudri ke paas gaya aur unse poocha, Kya tum hamare saath khajoor ke paidon ke paas baat karne nahi aaoge? Toh Abu Sa`id bahar gaye aur maine unse poocha, Batao ki tumne Nabi se Shab-e-Qadr ke baare mein kya suna? Abu Sa`id ne jawab diya, Ek baar Allah ke Rasool ﷺ ne Ramadan ke pehle das dinon mein I`tikaf kiya aur hmne bhi unke saath wahi kiya. Jibreel (alayhissalam) unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Isi liye Nabi ﷺ ne Ramadan ke beech ke dus dinon mein I`tikaf kiya aur hum bhi unke saath wahi kiye. Jibreel (alayhissalam) phir unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Ramadan ke beesve din ke subah Nabi ﷺ ne khutba diya kehte hue, 'Jo bhi log mere saath I`tikaf kar rahe hain, woh ise jaari rakhein. Mujhe Shab-e-Qadr dikhayi gayi thi, lekin uski taarikh bhool gaya, lekin yeh das raaton ki aakhri teeron mein hai. Maine apne khwab mein dekha ke maini kichad aur paani mein sajdah kar raha tha.' Us zamane mein masjid ka chhat khajoor ke paidon ki shaakhon se bani huyi thi. Us waqt aasmaan saaf tha aur koi badal nahi tha, lekin achank ek badal aaya aur baarish hui. Nabi ﷺ ne humein namaz mein imaamat ki aur maine dekha ke Allah ke Rasool ke maathay aur naak par kichad ke nishaan the. Isse woh khwab ka tasdeeq hua. <br/><br/> <b>Reference Number.2 (Sahih al Bukhari 2016):</b> <br/><br/>Narrated Abu Salama: Maine Abu Sa`id se poocha, jo mere dost the, (Shab-e-Qadr ke baare mein) aur unhone kaha, Humne Ramadan ke maheene ke beech mein rasulallah ﷺ ke saath masjid mein I`tikaf kiya. Ramadan ke beesve din ke subah, rasulallah ﷺ aaye aur humein kaha, 'Mujhe (Shab-e-Qadr ki taarikh) ka pata tha lekin mujhe bhoolne ka wajah diya gaya, isliye usse dhundho Ramadan ke das aakhri raaton mein. (Khwab mein) maine apne aapko kichad aur paani mein sajdah karte dekha (ek ishaara ke roop mein). Toh, jo bhi log mere saath I`tikaf mein the, woh mujhse phir I`tikaf karne ke liye wapas aaye', aur hum wapas aaye. Us waqt aasman mein badalon se dhaka hua tha aur baarish hui, aur masjid ke ibtedai imam ki namaz ke jagah se masjid ki chhat se paani nikalne laga jo khajoor ke patte ki shaakhon se bani huyi thi. Fir namaz qayam ki gayi aur maine Allah ke Rasool ko kichad aur paani mein sajdah karte dekha aur unke maathe par kichad ke nishaan dekhe. <br/><br/><b>Reference Number.3 (Sahih al Bukhari 2018):</b><br/><br/> Narrated Abu Sa`id Al-Khudri: Allah ke Rasool Ramadan ke maheene ke beech mein masjid mein I`tikaf karte the aur bees raaton ke guzar jaane ke baad unka ghar jaana hota tha beeswe din, aur unke saath I`tikaf mein jo log hote the, woh bhi apne ghar chale jaate the. Ek baar Ramadan mein, jismein unhone I`tikaf kiya tha, unhone wahi raat ki namaz qayam ki jis raat ko unhe ghar jaana hota tha, aur phir unhone logon se kuch farmaan kiya jo Allah ne unhe farmaane ko chaha aur kaha, 'Main pehle das dinon ke liye I`tikaf karta tha (yani maheene ke beech ke tisre hisse mein) lekin ab main maheene ke aakhri das dinon ke liye I`tikaf karne ka iraada rakhta hoon; isliye jo bhi mere saath I`tikaf mein the, woh apne apne I`tikaf ke maqam par rahen. Mujhe sach mein yeh raat (Shab-e-Qadr ki taarikh) dikhayi gayi thi lekin maine bhool gaya. Isliye isse dhundho is maheene ke das aakhri raaton mein.' Maine bhi apne aapko kichad aur paani mein sajdah karte dekha (khwab mein). Beeswein din ki raat ko aasman badalon se dhaka hua tha aur baarish hui, aur masjid ke upar se paani tapak raha tha jahan Allah ke Rasool (ﷺ) namaaz padhte the. Maine unhe dekha, aur jab unhone fajr ki namaaz padhli, toh unka chehra ganday mitti aur paani se bhig gaya tha. <br/><br/><b> Reference Number.4 (Sahih Muslim 2769): </b><br/><br/> Abu Sa'id al-Khudri ne bataya ki Allah ke Rasool (ﷺ) ne Ramadan ke mahine ke darmiyan 10 raaton ka i'tikaf kiya, aur jab 20 raatein guzar gayi aur bees-e-ek raat ho gayi (21), toh woh apne makaan mein laut gaye aur jo unke saath the, woh bhi apne apne makaanon mein chale gaye. Unhone ek mahine tak ibadat ki. Phir jab woh apne makaan mein wapas aaye, toh raat ko logon se kuch farmaaya jo Allah ki marzi thi, fir farmaya: Maine pehle 10 raaton mein i'tikaf kiya taake woh raat (Lailat-ul-Qadr) talash kar sakoon. Phir maine das dinon ke darmiyan i'tikaf kiya. Phir (ek farishta) mere paas bheja gaya aur mujhe bataya gaya ki yeh (raat) aakhri 10 dinon mein hai. Jo bhi tum mein se i'tikaf karna chahe, woh kar sakta hai; aur log uske saath i'tikaf karte rahe, aur unhone ( rasulallah ﷺ) ne farmaya: Woh (Lailat-ul-Qadr) mujhe ek bepari (raat) mein dikhayi gayi aur maine (khwaab mein dekha) ki main subah mitti aur paani mein sajdah kar raha hoon. Toh beeswein(20) raat ke subah jab woh (Pyare Nabi) fajr ki namaaz ke liye uth gaye, toh baarish hui aur masjid tapak rahi thi, aur maine mitti aur paani dekha. Jab woh subah ki namaaz padh kar bahar aaye (maine dekha) ki unke peshani aur naak ke tip par mitti aur paani ke nishan the, aur woh beeswin(20) raat thi aakhri das raaton mein se.<br/><br/> <b>Reference Number.5 (Sahih Muslim 2777):</b> <br/><br/> Zirr b. Habaish ne riwayat kiya: Maine Ubayy b. Ka'b (r.a.) se poocha: Tumhare bhai (imaan mein) Ibn Mas'ud kehte hain: Jo saal bhar raat ki namaz qayam karta hai, woh Lailat-ul-Qadr ko paata hai, jis par unhone kaha: Allah uspar rahmat farmaye; (unhone ye alfaz is iraade ke saath kaha) taake log sirf ek raat par bharosa na karein, jabki unhe pata tha ki (Lailat-ul-Qadr) Ramadan ke mahine mein hai aur yeh 27th raat hai. Phir unhon ne kasam khayi (bina kisi shart ke, yani ke In sha Allah ke kehne ke bina) ki yeh beeswein satwin raat hai. Maine unse kaha: Abu Mundhir, tum ye kis asal par keh rahe ho? Is par unhon ne kaha: Rasool Allah (ﷺ) ne humein us ishaare ya nishan se bataaya hai, aur woh yeh hai ki us din (suraj) baghair kisi kirne ke niklega.<br/><br/> Mafhoom - Qur'an ki in ayato se yahi pta chalta hai ke Shab-e-qadr , shawwal, shaban ya aur kisi mahine me nhi balki ramadan me hi hai aur ye sahih hadiths iski tasdeek deti h aur unse pta chlta hai ke ye ramadan ke akhri ashre k taak raato me se kisi bhi raat me ho skti h. (Odd nights of ramadan- 21,23,25,27,29).<br/><br/> <b> Aur 15 shaban ko shab e qadr declare krna ekdm nonsense si baat hai aur iska jawaz kahi Qur'an aur sunnat me nhi milta hai ye sbh bs kahaniya hai!</b>"
  },
  {
    "title": "Kya 15 Shaban ko khaas taur se roza rkhna sunnat se sabit hai? ",
    "body": "<b>15 shaban ke din khaas taur se roza rkhna Qur'an aur sahih ul insaad Hadiths se sabit nhi hai!</b><br/><br/><>Lihaza shaban me nafli roze rkhna sunnat e rasulallah ﷺ hai! Aur iss mahine me bhi nama-e-amal Allah ke huzur pesh hote hai!<br/><br/> <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 1969) :</b><br/><br/> Aisha r.a. kaha: Allah ke Rasool ﷺ roze rkhte the jab tak log yeh na kahe ke woh kabhi roza nahi chhorenge, phir unhone rozay chhod diye jab tak log yeh na kahe k woh kbhi roza nahi rkhnge. Maine kbhi nahi dekha ke Allah ke Rasool ﷺ kisi mahine me pura mahina roza rakhtay, siwaaye Ramadan ke, aur unhe kisi aur mahine me itna roza nhi rakhte the jitna Sha'ban mein rakhte the.<br/><br/> <b>Reference Number.2 (Sunan nasai 2359):</b> <br/><br/>Usamah bin Zaid ne kaha: Maine kaha: 'Ae Allah ke Rasool ﷺ, me apko Shaban k kisi bhi mahine itna roza nhi rkhte dekha, Unhone kaha: Yeh ek aisa mahina hai jise log zyada dhyan nahi dete, Rajab aur Ramadan ke beech mein. Yeh ek mahina hai jisme amal Allah Ta'ala tak pahunchaye jate hain, aur mujhe pasand hai ki mere amal roze mein le jaye jaye jab main roza rakhta hoon.<br/><br/><b>Aur bhi deegar Hadiths hai<br/>(Sahih Muslim 2721,2687,2722)<br/>(Mishkat ul masabih 2036,1305)<br/><br/></b> Even rasulallah ﷺ hare Monday aur Thursday ko roza rkha krte the!<br/><br/><b>Reference no.1<br/>(Sahih Muslim 6546)</b> <br/><br/> Allah ke Rasool (ﷺ) ne farmaya:Logon ke amal har haftay do dinon ko pesh kiye jaate hai, yaani Monday aur Thursday, aur har imaan wala banda bakshish paayega, siwaye us bande ke jiske dil mein uske bhai ke khilaaf dushmani ho, aur usse kaha jayega: Unhe chhod do aur unhe tab tak taal do jab tak woh sulah ho jaaye. <br/><br/>  <b> Reference no. 2<br/>(Tirmidhi 747) </b><br/> Abu Hurairah ne bayan kiya ki: Rasulallah ﷺ ne farmaya: Amaal Monday aur Thursday ko pesh kiye jaate hain, aur main chahta hoon ki mere amal tab pesh kiye jaayein jab main roza rakhta hoon <br/> Aur bhi deegar Hadiths me ye baat record hui hai: <br/> (Sahih Muslim 2750)<br/>(Mishkat ul masabih 2056,2045) <br/> <br/> To in sbh hadiths se pata chala k rasulallah ﷺ 11 roze to harr mahine me rkhte the 8 to ho gye ye monday aur Thursday ke.Aur baaki 3 ayyam al beed ke <br/><br/><b>Reference no.1<br/>(Sahih al Bukhari 1975)</b> <br/><br/> Rasulallah ﷺ ne kaha <br/>Tumhara liye, mahine mein teen din roza rakhna kafi hai, kyunki acche kamon ka sawab das guna badh jata hai, isliye yeh saal bhar ke roze rakhne ke barabar hoga.Puri hadith zrur pdhein! Aur bhi deegar Hadiths hai isse related (Sahih muslim 2744,2746)<br/>(Mishkat ul masabih 2046,2044)<br/>(Nasai 2347)<br/><br/> Conclusion:<br/> In sbh Hadiths ko nazar rkhte hue yahi mafhoom nikalta hai ke Rasulallah ﷺ har mahine 11 roze rkhte the lekin khaas taur se 15 shaban ke din roza rkhna kisi bhi sahih Hadith se sabit nhi hai lihaza agar aapko rasulallah ﷺ se muhabbat hai to ye 11 roze harr mahine ya atleast 3 roze ayyam al beedh ke harr mahine zrur rkha krein aur jo amal rasulallah ﷺ se sabit nhi hai to vo amal bid'ah me shumar hoga aur isse aap gunahgaar bhi honge!"
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah khas taur se aasman e duniya pe nuzul farmata hai aur logo ki maghfirat krta hai?",
    "body": "<b>Qur'an o sunnat se hme yahi baat pata chalti hai k Allah rabbul izzat ROZANA Raat ke akhri hisse me aasman e duniya pe nuzul farmata hai aur jo usse dua krta hai vo use qubul krta hai!</b><br/><br/><b>Reference no.1(Sahih al Bukhari 1145)</b><br/><br/> Rasulallah ﷺ ne farmaya: ki hamara parvardigar buland barkat wala hai har raat ko us waqt aasman duniya par aata hai jab raat ka aakhiri tihai hissa reh jaata hai. Wo kehta hai koi mujhse dua karne wala hai ki main uski dua qabool karoon, koi mujhse mangne wala hai ki main use doon, koi mujhse bakshish talab karne wala hai ki main use baksh doon.<br/><br/><b>Reference no.2(Sahih Muslim 1772)</b><br/><br/> Abu-Huraira (R.A) se riwayat ki ke Rasoolullah ﷺ ne farmaya: Barkat aur bulandi ka malik hamara Rab, *harr raat ko jab raat ka aakhiri tihai hissa baqi rah jata hai, (to) dunia ke aasman par nuzool farmata hai. Aur kehta hai: Kaun mujhe pukarta hai ki main uski pukar ko sunun? Kaun mujh se mangta hai ki main usko doon, aur kaun mujh se bakshish talab karta hai ki main use baksh doon? <br/><br/><b>Lihaza inn hadiths me rasulallah ﷺ ne wazeh bata diya hai k Allah ROZANA raat me nuzul farmata hai to kisi raat ko yun ibadat ke liye khaas kr lene ka koi matkab nhi banta koi sense nhi bnta aur ye amal fir bid'ah me shumar hoga!Lihaza jo kaam rozana ho rha hai to uss kaam ko kisi din ya kisi raat ko khaas kr lena beshaq ek bewakoofi hai! To iss kaam se bache aur jab chahe rozana iss fazilat se fayeda uthaye aur logo ki baato pe nhi sahih Hadith pe amal kre!</b>"
  },
  {
    "title": "Kya 15 Shaban ki raat ko khaas taur se zyada ibadat krne se zyada sawab milta hai?",
    "body": "<b>Ye baat kisi bhi Qur'an ki ayat ya sahih Hadith se sabit nahi hai, lihaza public me kuch mashoor Hadiths hai jo ki dae'ef hai aur kuch to munkir bhi hai, aaiye dekhein:</b><br/><br/><b>∆ Attention: Niche di gyi hadiths dae'ef hai, acceptable nahi hai. Bas batane k liye ye hadiths yaha likhi jaa rhi hai!</b><br/><br/><b>(Claim no.1) Tirmidhi 739(dae'ef)</b><br/>Hazrat Aisha (R.A.) kehti hai ke maine ek raat Rasulallah ﷺ ko ghayab paaya. To main (aap ki talaash mein) bahar nikli to kya dekhti hoon ki aap baqi'a qabristan mein hain. Aap ne farmaya: Kya tum dar rahi thi ki Allah aur uske Rasool tum par zulm karenge? Maine kaha: Allah ke Rasool! Mera gumaan tha ki aap apni kisi biwi ke paas gaye honge. Aap ne farmaya: Allah Ta'ala pandrahvi shaban ki raat ko aasmane-duniya par nuzool farmata hai. Aur Qabeela Kalb ki bakriyon ke balon se zyada taadad mein logon ki maghfirat farmata hai.<br/><br/>Imam Tirmizi kehte hain:<b><br/> 1- Ayesha (R.A.) ki hadith ko hum is sanad se sirf Hujjaj ki riwayat se jaante hain.<br/> 2- Maine Muhammad-bin-Ismail Bukhari (jo sahih Bukhari ke author hai) ko is hadith ko dae'ef therate hue suna! Yahya-bin-abi ziyadah ka Urwah se aur Hujjaj-bin-Arta ka Yahya-bin-Abi-Ziyadah se nahi suna.</b><br/>Mishkat ul masabih me bhi ye hadith hai 1299 number pe lekin vo bhi dae'ef hai!<br/><br/><b>(Claim no.2) Ibn-e-Majah 1388 (Dae'ef)</b><br/>Hazrat Ali (R.A) se rivayat hai, Rasulallah ﷺ ne farmaya: Jab aadhe Shaban ki raat aaye to is raat ko qiyaam karo aur din ko roza rakho. Is raat Allah taala suraj ke doobte hi pehle aasman par nuzool farma leta hai aur subah nikalne tak kehta rehta hai: Kya koi mujhse bakshish maangne wala hai ki main use maaf kar doon? Kya koi rizq talab karne wala hai ki use rizq doon? Kya koi (kisi bimari ya musibat mein) mubtala hai ki main use afiyat ata farma doon?\"<br/>Ye hadith mishkat ul masabih me bhi hai 1308 number pe lekin vo bhi dae'ef hai aur isme ek kazzab rawi hai iss wajah se ye ghadi hui riwayat hai to ye qabil e qubul ekdm nahi!<br/><br/><b>(Claim no.3) Ibn-e-Majah 1390(Dae'ef)</b><br/>Hazrat Abu Musa Ash'ari (RA) ne Rasulullah ﷺ se riwayat bayan ki ki aap ﷺ ne farmaya: \"Allah taala aadhe shaban ki raat (apne bandon par) nazar farmata hai, phir mushrik aur (musalman bhai se) dushmani rakhne wale ke siwa saari makhluq ki maghfirat farma deta hai.\"<br/>Ye hadith mishkat ul masabih me bhi hai 1306 number pe lekin vo bhi dae'ef hai.<br/>- Isme 2 majhool (unknown) ravi hai<br/>- Aur 2 mudallis rawi hai jo 'an se riwayat kar rahe hai aur imam Muslim ne sahih Muslim ke mukadme me likha hai k mudallis se 'an ki riwayat sama' ke tasreeh ke begair dae'ef tasawwur ki jayegi!!<br/><br/><b>Aur even Sheikh Zubair Ali Zai sahab ne bhi Mishkat pe jab iss Hadith pe hukum lagaya hai to likha hai ke Ye to andhero me dubi hui riwayat hai, dur dur tak isme roshni ki koi kiran bhi baaki nahi rahi.</b><br/><br/><b>Inn sab jhuthi, dae'ef, manghadat hadiths ko dekhne aur samjhne ke baad ke baad yahi pata chalta hai ki aaj ke waqt ye sab baatein bht mashhoor hai aur bht bhari tadaat me log in sab baaton pe believe karte hai aur even bht se jahil molvi bhi apne mimbaro se ye jhuthi Hadith la ilmo ke wajah se logo me faila rahe hote hai!<br/>Lihaza haq aur batil me farq krne k baad batil se dur hate aur bakiyo ko bhi iss baat se agha karein!</b>"
  },
  {
    "title": "Kya 15 shaban ki raat ko hamare aamal Allah ke huzur pesh hote hai to hum logo ko aur zyada naik amal krne chahiye?",
    "body": "Beshaq deegar hadiths se ye pta chalta hai ke shaban k mahine me amaal Allah k huzur pesh hote hai jaise ki ye Hadith : <br/><br/><b>Sunan nasai 2359</b><br/>    Hazrat Usama bin Zaid (R.A.) se naqal hui hai ki maine (Rasoolullah ﷺ se) kaha: <b>Aye Allah ke Rasool! Maine aap ko kisi mahine mein itne roze rakhte nahi dekha jitne aap Shaban mein rakhte hain. (Kya wajah hai?) Aap ne farmaya: Ye woh mahina hai ki Rajab aur Ramzan mubarak ke beech aane ki wajah se log isse ghafilat kar jaate hain. Halanki ye woh mahina hai ki isme Rab-ul-Alameen ke yahan insano ke kaam pesh kiye jaate hain. Main chahta hoon ki mere amal pesh hon toh main roze se hoon.</b>Lekin rasulallah ﷺ ne ye kahi nhi farmaya ke 15 shaban ko hi Allah k huzur amal pesh ho rhe hote hai <br/>•halaki rasulallah ﷺ yaha jb shaban ka naam le skte h to uss din ka bhi bta dete lekin Allah ne itni baat hi ummat tak baat phnchani chahi.<br/>   <b>• aur agr sirf 15 shaban ko hi aisa ho rha hota to rasulallah ﷺ khud vo pehli shaksiyat hote jo extra amal kr rhe hote rt bhr namaze pdh rhe hote lekin nhi aisa nhi tha , halaki rasulallah ﷺ pure mahine hi roza rkh rhe the aur reason bhi yhi diya k iss mahine amal pes hote h to mai chahta hu k Jab bhi ho to mai ishi haal me paya jau k mai roze se hu! Beshaq Rasulallah ﷺ se zyada aap namazi ya rozgaar nhi hai to behtar rhega k hum rasulallah ﷺ ko hi follow kre</b><br/><br/> Aur agr Allah ke huzur amal pesh hone ki hi baat hai to ye kaam to din me 2 dafa bhi ho rha hota h , ek fjr me aur dusra asr me!<b><br/><br/>Reference no.1<br/>(Sahih al Bukhari 555)</b> Rasulallah ﷺ ne farmaya ki raat aur din me farishton ki duties badalti rahti hain. Aur Fajr aur Asr ki namaazon mein (duty par aane walon aur rukhsat paane walon ka) ijtimaa hota hai. Phir tumhare paas rahne wale farishte jab upar chadhte hain to Allah Ta'ala poochta hai, haalanki wo unse bahut zyada apne bandon ke mutaalliq jaanta hai ki mere bandon ko tumne kis haal mein chhoda. Wo jawab dete hain ki humne jab unhein chhoda to wo (Fajr ki) namaaz padh rahe the. Aur jab unke paas gaye tab bhi wo (Asr ki) namaaz padh rahe the.<b><br/><br/>Reference no.2<br/>(Sahih Muslim 1432)</b> Abu Zinad ne Arz se, unhone Hazrat Abu Huraira (R.A) se riwayat ki ki Rasulallah ﷺ ne farmaya: Raat ke farishte aur din ke farishte ek-dusre ke piche tumhare beech aate hain aur Fajr ki namaz aur Asr ki namaz ke waqt wo ikatthe ho jaate hain, phir jinhone tumhare beech raat guzari hoti hai. Wo upar chale jaate hain, unse unka Rab poochta hai, halanki wo unse zyada jaanta hai. Tum mere bandon ko kis haal mein chhod kar aaye ho? Wo jawab dete hain: Hum unhein (is haalat mein) chhod kar aaye hain ki wo namaz padh rahe the aur hum unke paas (kal Asr ke waqt) is haalat mein pahunchte the ki wo namaz padh rahe the.<br/><br/>In hadiths se pta chala k amal roz hi in 2 waqt pesh ho rahe hote hai lekin Musalmano ki aksariyat in 2 namazo ko hi zyada tarr nazarandaaz krti h ,khususan fjr k nmz ko.<br/><br/>Aur agr kisi din ya raat ko koi khaas amal karne ki ijazat hoti to vo dino ke sardar wale din yaani jumuah ko hoti! Lekin jumuah ko bhi koi khaas amal (jo rasulallah ya ashaab e rasool se sabit na ho) krne se mana kiya gya h!<b><br/><br/>Reference no.1<br/>(Sahih Muslim 2687)</b>Hazrat Abu Huraira r.a. se riwayat hai ki Nabi Kareem ﷺ ne farmaya ki raaton mein se Jumma ki raat ko Qiyaam ke saath makhsoos na karo aur na hi dino mein se Jumma ke din ko roze ke saath makhsoos karo siwaye is ke ki tum mein se jo koi roze rakh raha ho.<br/><br/> <b>Ye hadith Mishkat ul masabih 2052 me bhi hai.</b>"
  },
  {
    "title": "Kya 15 shaban ki raat ko kabristan jana aur candles/agarbattiyan lgana sunnat h?",
    "body": "<b>Iska jawab naahi Qur'an me aur naahi kisi bhi sahih hadith me aur naa hi even kisi dae'ef Hadith me bhi milta hai k rasulallah ﷺ ya koi sahaba kisi din khas taur se qabristan gye ho aur waha candle ya agarbatti lgaye ho! <br/> Beshaq hum log se bht behtar log bhi jaa chuke h iss duniya se rasulallah ﷺ aur sahabao ke daur me lekin kisi bhi din khaas taur se kabristan jaa k waha candles ya agarbatti lgana ka jawaz kahi se sabit nhi hai! Even ye tareeka to jews aur Christians ka hai ke vo saalana apne graveyards me jaate hai aur waha candles wgaira lgate hai, aur iss kaam me rasulallah ﷺ ki waeed bhi dekh lijiye kitni sakht hai</b><b><br/><br/>Reference no.1<br/>(Abu dawood 3512)</b><br/><br/>Abd-Allah ibn 'Umar ne kaha: Nabi ﷺ  ne farmaya: 'Jo bhi kisi qaum ki nakal karta hai, woh unmein se ek hai.<br/><br/><b>Reference no.2<br/>(Sahih Bukhari 7320)</b><br/><br/> Nabi Kareem ﷺ ne farmaya, Tum apne se pehli ummaton ki ek-ek balisht aur ek-ek gaz mein pairwi karoge, yahan tak ki agar wo kisi goh ke soorakh mein daakhil hue honge to tum usmein bhi unki pairwi karoge. Humne poocha: Ya Rasoolullah! Kiya Yahood aur Nasara murad hain? Farmaya, Fir aur kaun.<br/><br/>Lekin haa, kabristan jaana sunnat e rasulallah ﷺ hai aur hukum bhi hai , taake hame apni maut ka remind ho!<br/><br/><b>Reference no.2<br/>(Sahih Muslim 976)</b><br/><br/>Hazrat Huraira (RA) se riwayat hai, unhone kaha: Rasoolullah ﷺ ne apni maa ki qabr ki ziyarat ki, aap roye aur apne aas-paas walon ko bhi rulaya, phir farmaya: Mainne apne Rab se ijazat manga ki main unke liye bakshish talab karun to mujhe ijazat nahi di gayi aur mainne ijazat manga ki main unki qabr ki ziyarat karun to usne mujhe ijazat de di, isliye tum bhi qabron ki ziyarat kiya karo kyunke wo tumhein maut ki yaad dilati hai.<br/><br/><b> To humlog ko chahiye ke harr hafte ya atleast harr mahine me ek br kabristan jaye aur apni maut ko yd krke isse ibrat hasil kre lekin saal me sirf ek din khaas taur se jana aur apne azeez logo ke liye sirf ek hi din maghfirat ki dua krna, ye sbh glt hai blki hme rozana aise kaam krne chahiye Allah ko bhi wahi amal psnd hai jo chote bhale hi ho lekin rozana kre aur kabristan me candles ya agarbattiyan lgana kch nhi lekin jews aur Christians ko copy krna h to iss faltu kaam se bache vrna aap gunahgaar honge!</b>"
  },
  {
    "title": "Kya 15 shaban ke din khas taur se halwa ya koi meethi chiz bnana sunnat hai?",
    "body": "<b>Kuch logo ka ye manna hai ke iss din rasulallah ﷺ ke daant mubarak shaheed ho gye the to aapko halwa bna k khilaya gya tha. <br/><br/>Balki ye baat ekdm jhuthi aur manghadat baat hai <br/><br/>  Asal me Haqeeqat ye hai ke jis gazwe me rasulallah ﷺ ke daant mubarak shaheed hue the vo gazwa e uhud me hua tha jo ki shawwal ki 3 hijri me hua tha Naa ke shaban me aur aisa kisi bhi sahih Hadiths me nhi aaya hai k uss din bhi unhe halwa khilaya gya ho even aisi koi dae'ef hadith bhi nhi hai ye sbh bs manghadat baate hai <br/><br/> Aur ye baat bhi ki jaati hai ke owais qarni taba'i ne muhabbat e rasool me apne tamam daanto ko tod liya tha to jannat se unke liye halwa aaya <br/><br/> Lekin ye baat bhi ekdm jhuthi hai aur manghadat baat hai iska bhi jawaaz kisi bhi sahih Hadith me nhi milta.<br/><br/>aur agr for the sake of argument ye glt baat ko shi bhi maan liya jaye to baat ye nikalti hai k nowadays jo halwa bna k khaa rhe hai unke daant aur sehat ekdm tandrust hai to unhe chahiye ke vo bhi apne daant tode aur fir halwa khaye taake owais qarni taba'i ke sunnat pe sahi se amal ho!<br/><br/>Lihaza ye sbh jhuthe waqiyaat ke peeche ldna ekdm bewakoofi hai aur isse koi result nhi nikalta silwaye iske ke ye baate jhuthi hai!<br/><br/>Aur ta'ajjub hota hai ke ye baate hmare msjd ke  imam log la ilmi me apne mimbaro se bayan krte hai , unko bhi chahiye ke vo apni islah kre.<br/><br/>Aur kuch molvi to bayaan hi is liye krte hai k unhe bhi iss din khud halwa mile aur iska maza le, unhe Allah se darna chahiye kyuki aisi jhuthi baatein faila ke duniya me to halwe ka maza mil skta hai lekin akhirat me sirf saza milegi aur kch nhi to lihaza ye sbh faltu kaamo ko chorhe aur asal deen pe 'amal kre!</b>"
  },
  {
    "title": "Bid'ah Kya Hai? Aur Shab-e-Barat Bid'ah Mein Kyun Aata Hai!!",
    "body": "<b>Arabic mein bid’ah shabd ka mool arth hai kisi cheez ko shuru karna bina kisi pehle ke udaharan ke.</b><br/> Shari’ah ke padon mein, bid’ah ka matlab hai aisi koi cheez jo Allah ke dharmon mein daakhil ki gayi hai lekin iske liye koi samanya ya khaas basis nahi hai ise support karne ke liye.<br/><br/>Is topic par ek mashhoor Hadith bhi hai, jismein Nabi Muhammad ﷺ ne farmaya: \"Behtareen baat Allah ki kitab mein hai, aur behtareen hidayat Muhammad ki hidayat hai. Aur sabse bura kaam unki bida'aton (innovations) hain, aur har bida'at gumraahi hai.\"<br/><br/><b> Sahih Muslim 867a <br/>    Sunan Nasai 1578</b><br/> <br/> Is Hadith se samajh aata hai ki bida'at insaan ko galat raaste par le jaati hai, aur jo log galat raaste par hain, woh aakhirat mein aag mein pahunchenge. Ab sawaal ye uthta hai ki Nabi Muhammad ﷺ kaunsi bida'at keh rahe hain? Kya ye gadiyan, buses, ya iPad jaise cheezein hain? Nahi.<br/><br/>Isse murad un cheezon, rasmon, ya aqeedon ki baat hai jo log Islam ke imaan mein baad me shaamil karte hain (Nabi ke baad). Is context mein Shab-e-Barat ke mahine mein bhi bida'at ko highlight karna chahiye.<br/><br/>Ab sawaal ye hai ki bida'at kaise define ki ja sakti hai? Ek example ke saath clear karte hain. Maan lo kal koi Musalman decide kare ki humein din mein paanch martaba namaz padhni chahiye, jaise 10 baje subah ka jamaat. Agar aise kuch naya shuru kiya jaaye aur masjid mein iske liye azaan di jaaye, to kya ye Allah dwara qubool hoga ya nahi?<br/>Iski wajah hai ke Nabi Muhammad ﷺ ne aisa nahi kiya, isliye humein ismein ek principle milta hai ki har ilahi mamle mein, jaise namaz ya roza, uske liye kisi daleel ki zarurat hoti hai, warna woh qubool nahi hota. Aur duniyavi mamle jaise car ya phone, unka status yeh hai ke jab tak kisi daleel se inki manaahi nahi hoti, tab tak inka istemaal jaayaz hai.<br/><b>Analogically</b> hum yeh nikal sakte hain ki kisi bhi din ko khaas ibadat ke liye manana (jaise 15 Shaban) Nabi Muhammad ﷺ ne nahi kiya tha. Sunnat toh hai ki hum Ayyam Al Beedh (13, 14, 15 tareekh) mein roza rakhein. Allah behtar jaanta hai. Allah humein hidayat de. Ameen."
  }
  
]
