[
  {
    "title": "Kya 15 Shaban ki raaat ko quran naazil hua tha?",
    "body": " <b>Aaiye jaane ki Qur'an iske baare me kya kehta hai?</b><br/><br/><b>Surat No 2 : سورة البقرة - Ayat No 185<br/> شَہۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡہِ الۡقُرۡاٰنُ </b><br/> Ramzan woh mahina hai jisme Quran utara gaya <br/> Iss Ayat se pata chala k Qur'an, shaban ya aur kisi mahine me nhi balki ramadan me hi nazil hona shuru Hua hai! <br/>Aur mazeed iss raat k baare me Allah ne farmaya:<br/><br/><b>Surat No 44 : سورة الدخان - Ayat No 3 <br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ </b><br/>Hamne ise ek badi khaair aur barkatwali raat mein utara hai<br/> Aur mazeed Allah ne Qur'an me hi uss raat ka bhi zikr kr diya hai balki puri surah hi uss raat k naam pe hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 1 <br/>اِنَّاۤ اَنۡزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/> Humne is (Qur'an) ko Shabe-Qadr mein nazil kiya hai.<br/><br/><b>Surat No 97 : سورة القدر - Ayat No 2 <br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/> Aur tum kya jaano ki Shabe-Qadr kya hai?<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 3 <br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/> Shabe-Qadr hazaar mahinon se zyada behtar hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 4 <br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/> Farishte aur rooh usmein apne Rab ke izn se har hukm lekar utarte hain. <br/><br/><b>Surat No 97 : سورة القدر - Ayat No 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/> Vo raat saraasar salaamati hai, Tulu-e-Fajr tak.<br/> • Qadr kehte hi destiny ko hai, jisme takdeer ke faisle hote hai!<br/><br/> Hadiths me rasulallah ﷺ ne iske baare me aur briefly bataya hai: <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 813) :</b><br/><br/>Narrated Abu Salama: Ek baar main Abu Sa`id Al-Khudri ke paas gaya aur unse poocha, Kya tum hamare saath khajoor ke paidon ke paas baat karne nahi aaoge? Toh Abu Sa`id bahar gaye aur maine unse poocha, Batao ki tumne Nabi se Shab-e-Qadr ke baare mein kya suna? Abu Sa`id ne jawab diya, Ek baar Allah ke Rasool ﷺ ne Ramadan ke pehle das dinon mein I`tikaf kiya aur hmne bhi unke saath wahi kiya. Jibreel (alayhissalam) unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Isi liye Nabi ﷺ ne Ramadan ke beech ke dus dinon mein I`tikaf kiya aur hum bhi unke saath wahi kiye. Jibreel (alayhissalam) phir unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Ramadan ke beesve din ke subah Nabi ﷺ ne khutba diya kehte hue, 'Jo bhi log mere saath I`tikaf kar rahe hain, woh ise jaari rakhein. Mujhe Shab-e-Qadr dikhayi gayi thi, lekin uski taarikh bhool gaya, lekin yeh das raaton ki aakhri teeron mein hai. Maine apne khwab mein dekha ke maini kichad aur paani mein sajdah kar raha tha.' Us zamane mein masjid ka chhat khajoor ke paidon ki shaakhon se bani huyi thi. Us waqt aasmaan saaf tha aur koi badal nahi tha, lekin achank ek badal aaya aur baarish hui. Nabi ﷺ ne humein namaz mein imaamat ki aur maine dekha ke Allah ke Rasool ke maathay aur naak par kichad ke nishaan the. Isse woh khwab ka tasdeeq hua. <br/><br/> <b>Reference Number.2 (Sahih al Bukhari 2016):</b> <br/><br/>Narrated Abu Salama: Maine Abu Sa`id se poocha, jo mere dost the, (Shab-e-Qadr ke baare mein) aur unhone kaha, Humne Ramadan ke maheene ke beech mein rasulallah ﷺ ke saath masjid mein I`tikaf kiya. Ramadan ke beesve din ke subah, rasulallah ﷺ aaye aur humein kaha, 'Mujhe (Shab-e-Qadr ki taarikh) ka pata tha lekin mujhe bhoolne ka wajah diya gaya, isliye usse dhundho Ramadan ke das aakhri raaton mein. (Khwab mein) maine apne aapko kichad aur paani mein sajdah karte dekha (ek ishaara ke roop mein). Toh, jo bhi log mere saath I`tikaf mein the, woh mujhse phir I`tikaf karne ke liye wapas aaye', aur hum wapas aaye. Us waqt aasman mein badalon se dhaka hua tha aur baarish hui, aur masjid ke ibtedai imam ki namaz ke jagah se masjid ki chhat se paani nikalne laga jo khajoor ke patte ki shaakhon se bani huyi thi. Fir namaz qayam ki gayi aur maine Allah ke Rasool ko kichad aur paani mein sajdah karte dekha aur unke maathe par kichad ke nishaan dekhe. <br/><br/><b>Reference Number.3 (Sahih al Bukhari 2018):</b><br/><br/> Narrated Abu Sa`id Al-Khudri: Allah ke Rasool Ramadan ke maheene ke beech mein masjid mein I`tikaf karte the aur bees raaton ke guzar jaane ke baad unka ghar jaana hota tha beeswe din, aur unke saath I`tikaf mein jo log hote the, woh bhi apne ghar chale jaate the. Ek baar Ramadan mein, jismein unhone I`tikaf kiya tha, unhone wahi raat ki namaz qayam ki jis raat ko unhe ghar jaana hota tha, aur phir unhone logon se kuch farmaan kiya jo Allah ne unhe farmaane ko chaha aur kaha, 'Main pehle das dinon ke liye I`tikaf karta tha (yani maheene ke beech ke tisre hisse mein) lekin ab main maheene ke aakhri das dinon ke liye I`tikaf karne ka iraada rakhta hoon; isliye jo bhi mere saath I`tikaf mein the, woh apne apne I`tikaf ke maqam par rahen. Mujhe sach mein yeh raat (Shab-e-Qadr ki taarikh) dikhayi gayi thi lekin maine bhool gaya. Isliye isse dhundho is maheene ke das aakhri raaton mein.' Maine bhi apne aapko kichad aur paani mein sajdah karte dekha (khwab mein). Beeswein din ki raat ko aasman badalon se dhaka hua tha aur baarish hui, aur masjid ke upar se paani tapak raha tha jahan Allah ke Rasool (ﷺ) namaaz padhte the. Maine unhe dekha, aur jab unhone fajr ki namaaz padhli, toh unka chehra ganday mitti aur paani se bhig gaya tha. <br/><br/><b> Reference Number.4 (Sahih Muslim 2769): </b><br/><br/> Abu Sa'id al-Khudri ne bataya ki Allah ke Rasool (ﷺ) ne Ramadan ke mahine ke darmiyan 10 raaton ka i'tikaf kiya, aur jab 20 raatein guzar gayi aur bees-e-ek raat ho gayi (21), toh woh apne makaan mein laut gaye aur jo unke saath the, woh bhi apne apne makaanon mein chale gaye. Unhone ek mahine tak ibadat ki. Phir jab woh apne makaan mein wapas aaye, toh raat ko logon se kuch farmaaya jo Allah ki marzi thi, fir farmaya: Maine pehle 10 raaton mein i'tikaf kiya taake woh raat (Lailat-ul-Qadr) talash kar sakoon. Phir maine das dinon ke darmiyan i'tikaf kiya. Phir (ek farishta) mere paas bheja gaya aur mujhe bataya gaya ki yeh (raat) aakhri 10 dinon mein hai. Jo bhi tum mein se i'tikaf karna chahe, woh kar sakta hai; aur log uske saath i'tikaf karte rahe, aur unhone ( rasulallah ﷺ) ne farmaya: Woh (Lailat-ul-Qadr) mujhe ek bepari (raat) mein dikhayi gayi aur maine (khwaab mein dekha) ki main subah mitti aur paani mein sajdah kar raha hoon. Toh beeswein(20) raat ke subah jab woh (Pyare Nabi) fajr ki namaaz ke liye uth gaye, toh baarish hui aur masjid tapak rahi thi, aur maine mitti aur paani dekha. Jab woh subah ki namaaz padh kar bahar aaye (maine dekha) ki unke peshani aur naak ke tip par mitti aur paani ke nishan the, aur woh beeswin(20) raat thi aakhri das raaton mein se.<br/><br/> <b>Reference Number.5 (Sahih Muslim 2777):</b> <br/><br/> Zirr b. Habaish ne riwayat kiya: Maine Ubayy b. Ka'b (r.a.) se poocha: Tumhare bhai (imaan mein) Ibn Mas'ud kehte hain: Jo saal bhar raat ki namaz qayam karta hai, woh Lailat-ul-Qadr ko paata hai, jis par unhone kaha: Allah uspar rahmat farmaye; (unhone ye alfaz is iraade ke saath kaha) taake log sirf ek raat par bharosa na karein, jabki unhe pata tha ki (Lailat-ul-Qadr) Ramadan ke mahine mein hai aur yeh 27th raat hai. Phir unhon ne kasam khayi (bina kisi shart ke, yani ke In sha Allah ke kehne ke bina) ki yeh beeswein satwin raat hai. Maine unse kaha: Abu Mundhir, tum ye kis asal par keh rahe ho? Is par unhon ne kaha: Rasool Allah (ﷺ) ne humein us ishaare ya nishan se bataaya hai, aur woh yeh hai ki us din (suraj) baghair kisi kirne ke niklega.<br/><br/> Mafhoom - Qur'an ki in ayato se yahi pta chalta hai ke Shab-e-qadr , shawwal, shaban ya aur kisi mahine me nhi balki ramadan me hi hai aur ye sahih hadiths iski tasdeek deti h aur unse pta chlta hai ke ye ramadan ke akhri ashre k taak raato me se kisi bhi raat me ho skti h. (Odd nights of ramadan- 21,23,25,27,29).<br/><br/> <b> Aur 15 shaban ko shab e qadr declare krna ekdm nonsense si baat hai aur iska jawaz kahi Qur'an aur sunnat me nhi milta hai ye sbh bs kahaniya hai!</b>"
  },
  {
    "title": "Kya 15 Shaban ko khaas taur se roza rkhna sunnat se sabit hai? ",
    "body": "<b>15 shaban ke din khaas taur se roza rkhna Qur'an aur sahih ul insaad Hadiths se sabit nhi hai!</b><br/><br/><b>Lihaza shaban me nafli roze rkhna sunnat e rasulallah ﷺ hai! Aur iss mahine me bhi nama-e-amal Allah ke huzur pesh hote hai!<br/><br/> <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 1969) :</b><br/><br/> Aisha r.a. kaha: Allah ke Rasool ﷺ roze rkhte the jab tak log yeh na kahe ke woh kabhi roza nahi chhorenge, phir unhone rozay chhod diye jab tak log yeh na kahe k woh kbhi roza nahi rkhnge. Maine kbhi nahi dekha ke Allah ke Rasool ﷺ kisi mahine me pura mahina roza rakhtay, siwaaye Ramadan ke, aur unhe kisi aur mahine me itna roza nhi rakhte the jitna Sha'ban mein rakhte the.<br/><br/> <b>Reference Number.2 (Sunan nasai 2359):</b> <br/><br/>Usamah bin Zaid ne kaha: Maine kaha: 'Ae Allah ke Rasool ﷺ, me apko Shaban k kisi bhi mahine itna roza nhi rkhte dekha, Unhone kaha: Yeh ek aisa mahina hai jise log zyada dhyan nahi dete, Rajab aur Ramadan ke beech mein. Yeh ek mahina hai jisme amal Allah Ta'ala tak pahunchaye jate hain, aur mujhe pasand hai ki mere amal roze mein le jaye jaye jab main roza rakhta hoon.<br/><br/><b>Aur bhi deegar Hadiths hai<br/>(Sahih Muslim 2721,2687,2722)<br/>(Mishkat ul masabih 2036,1305)<br/><br/></b> Even rasulallah ﷺ hare Monday aur Thursday ko roza rkha krte the!<br/><br/><b>Reference no.1<br/>(Sahih Muslim 6546)</b> <br/><br/> Allah ke Rasool (ﷺ) ne farmaya:Logon ke amal har haftay do dinon ko pesh kiye jaate hai, yaani Monday aur Thursday, aur har imaan wala banda bakshish paayega, siwaye us bande ke jiske dil mein uske bhai ke khilaaf dushmani ho, aur usse kaha jayega: Unhe chhod do aur unhe tab tak taal do jab tak woh sulah ho jaaye. <br/><br/>  <b> Reference no. 2<br/>(Tirmidhi 747) </b><br/> Abu Hurairah ne bayan kiya ki: Rasulallah ﷺ ne farmaya: Amaal Monday aur Thursday ko pesh kiye jaate hain, aur main chahta hoon ki mere amal tab pesh kiye jaayein jab main roza rakhta hoon <br/> Aur bhi deegar Hadiths me ye baat record hui hai: <br/> (Sahih Muslim 2750)<br/>(Mishkat ul masabih 2056,2045) <br/> <br/> To in sbh hadiths se pata chala k rasulallah ﷺ 11 roze to harr mahine me rkhte the 8 to ho gye ye monday aur Thursday ke.Aur baaki 3 ayyam al beed ke <br/><br/><b>Reference no.1<br/>(Sahih al Bukhari 1975)</b> <br/><br/> Rasulallah ﷺ ne kaha <br/>Tumhara liye, mahine mein teen din roza rakhna kafi hai, kyunki acche kamon ka sawab das guna badh jata hai, isliye yeh saal bhar ke roze rakhne ke barabar hoga.Puri hadith zrur pdhein! Aur bhi deegar Hadiths hai isse related (Sahih muslim 2744,2746)<br/>(Mishkat ul masabih 2046,2044)<br/>(Nasai 2347)<br/><br/> Conclusion:<br/> In sbh Hadiths ko nazar rkhte hue yahi mafhoom nikalta hai ke Rasulallah ﷺ har mahine 11 roze rkhte the lekin khaas taur se 15 shaban ke din roza rkhna kisi bhi sahih Hadith se sabit nhi hai lihaza agar aapko rasulallah ﷺ se muhabbat hai to ye 11 roze harr mahine ya atleast 3 roze ayyam al beedh ke harr mahine zrur rkha krein aur jo amal rasulallah ﷺ se sabit nhi hai to vo amal bid'ah me shumar hoga aur isse aap gunahgaar bhi honge!"
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah khas taur se aasman e duniya pe nuzul farmata hai aur logo ki maghfirat krta hai?",
    "body": "<b>Qur'an o sunnat se hme yahi baat pata chalti hai k Allah rabbul izzat ROZANA Raat ke akhri hisse me aasman e duniya pe nuzul farmata hai aur jo usse dua krta hai vo use qubul krta hai!</b><br/><br/><b>Reference no.1(Sahih al Bukhari 1145)</b><br/><br/> Rasulallah ﷺ ne farmaya: ki hamara parvardigar buland barkat wala hai har raat ko us waqt aasman duniya par aata hai jab raat ka aakhiri tihai hissa reh jaata hai. Wo kehta hai koi mujhse dua karne wala hai ki main uski dua qabool karoon, koi mujhse mangne wala hai ki main use doon, koi mujhse bakshish talab karne wala hai ki main use baksh doon.<br/><br/><b>Reference no.2(Sahih Muslim 1772)</b><br/><br/> Abu-Huraira (R.A) se riwayat ki ke Rasoolullah ﷺ ne farmaya: Barkat aur bulandi ka malik hamara Rab, *harr raat ko jab raat ka aakhiri tihai hissa baqi rah jata hai, (to) dunia ke aasman par nuzool farmata hai. Aur kehta hai: Kaun mujhe pukarta hai ki main uski pukar ko sunun? Kaun mujh se mangta hai ki main usko doon, aur kaun mujh se bakshish talab karta hai ki main use baksh doon? <br/><br/><b>Lihaza inn hadiths me rasulallah ﷺ ne wazeh bata diya hai k Allah ROZANA raat me nuzul farmata hai to kisi raat ko yun ibadat ke liye khaas kr lene ka koi matkab nhi banta koi sense nhi bnta aur ye amal fir bid'ah me shumar hoga!Lihaza jo kaam rozana ho rha hai to uss kaam ko kisi din ya kisi raat ko khaas kr lena beshaq ek bewakoofi hai! To iss kaam se bache aur jab chahe rozana iss fazilat se fayeda uthaye aur logo ki baato pe nhi sahih Hadith pe amal kre!</b>"
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah duniya ke akhri aasmaan pe aata hai aur logon ki farmata hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko khaas taur se zyada ibadat karne ka zyada sawaab hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ko khaas taur se halwa bnana aur sbko khilana sunnat se sabit hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya iss raat naama-e-amaal Allah k huzur pesh hote hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "What is innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Why is celebrating Shab-e-Baraat an innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  }
]
