[
  {
    "title": "کیا قرآن شبِ برات یعنی شعبان کی پندرہویں رات کو نازل ہوا؟",
    "body": "<b>چلو قرآن ہی کی کیا کہتا ہے:</b><br/><br/><b>سورۃ نمبر 2: البقرۃ - آیت نمبر 185</b><br/>رمضان وہ مہینہ ہے جس میں قرآن نازل ہوا۔<br/>یہ آیت اس بات کی اشارہ کرتی ہے کہ قرآن رمضان میں نازل ہوا، نہ کہ شعبان یا کسی اور مہینے میں۔<br/>علاوہ ازیں، اللہ نے اس رات کے بارے میں بتایا ہے:<br/><br/><b>سورۃ نمبر 44: الدخان - آیت نمبر 3</b><br/>ہم نے اسے [قرآن] ایک مبارک رات میں نازل کیا۔<br/>اور اللہ نے قرآن میں اس رات کا ذکر کیا ہے؛ بلکہ ایک پورا سورہ اس کے نام پر مشتمل ہے۔<br/><br/><b>سورۃ نمبر 97: القدر - آیت نمبر 1</b><br/>\"بیشک ہم نے قرآن قدر کی رات میں نازل کیا۔\"<br/><br/><b>سورۃ نمبر 97: القدر - آیت نمبر 2</b><br/>\"اور تمہیں کیا معلوم کہ قدر کی رات کیا ہے؟\"<br/><br/><b>سورۃ نمبر 97: القدر - آیت نمبر 3</b><br/>\"قدر کی رات ہزار مہینوں سے بہتر ہے۔\"<br/><br/><b>سورۃ نمبر 97: القدر - آیت نمبر 4</b><br/>\"ہر امر کے لئے فرشتے اور روح اس میں اپنے رب کی اجازت سے نازل ہوتے ہیں۔\"<br/><br/><b>سورۃ نمبر 97: القدر - آیت نمبر 5</b><br/>\"یہ سلامتی ہے جس کا باغروں کی نظریں کرنے تک انتظار ہے۔\"<br/>قدر کا معنی تقدیر ہے، جس میں فرمان جاری کیے جاتے ہیں!<br/>حدیثوں میں، پیغمبر محمد ﷺ نے اس کے بارے میں مختصر بات کی ہے:<br/><br/><b>حوالہ نمبر 1 (صحیح البخاری 813)</b><br/> میں ابوسعید خدری رضی اللہ عنہ کی خدمت میں حاضر ہوا ۔ میں نے عرض کی کہ فلاں نخلستان میں کیوں نہ چلیں ، سیر بھی کریں گے اور کچھ باتیں بھی کریں . چنانچہ آپ تشریف لے چلے ۔ ابوسلمہ نے بیان کیا کہ میں نے راہ میں کہا کہ شب قدر سے متعلق آپ نے اگر کچھ نبی کریم ﷺ سے سنا ہے تو اسے بیان کیجئے ۔ انہوں نے کہا کہ نبی کریم ﷺ نے رمضان کے پہلے عشرے میں اعتکاف کیا اور ہم بھی آپ کے ساتھ اعتکاف میں بیٹھ گئے ، لیکن جبریل علیہ السلام نے آ کر بتایا کہ آپ جس کی تلاش میں ہیں ( شب قدر ) وہ آگے ہے ۔ چنانچہ آپ نے دوسرے عشرے میں بھی اعتکاف کیا اور آپ کے ساتھ ہم نے بھی ۔ جبریل علیہ السلام دوبارہ آئے اور فرمایا کہ آپ جس کی تلاش میں ہیں وہ ( رات ) آگے ہے ۔ پھر آپ نے بیسویں رمضان کی صبح کو خطبہ دیا ۔ آپ نے فرمایا کہ جس نے میرے ساتھ اعتکاف کیا ہو وہ دوبارہ کرے ۔ کیونکہ شب قدر مجھے معلوم ہو گئی ۔ لیکن میں بھول گیا اور وہ آخری عشرہ کی طاق راتوں میں ہے اور میں نے خود کو کیچڑ میں سجدہ کرتے دیکھا ۔ مسجد کی چھت کھجور کی ڈالیوں کی تھی ۔ مطلع بالکل صاف تھا کہ اتنے میں ایک پتلا سا بادل کا ٹکڑا آیا اور برسنے لگا ۔ پھر نبی کریم ﷺ نے ہم کو نماز پڑھائی ۔ اور میں نے رسول کریم ﷺ کی پیشانی اور ناک پر کیچڑ کا اثر دیکھا ۔ آپ کا خواب سچا ہو گیا ۔b<r/><br/><b>حوالہ نمبر 2 (صحیح البخاری 2016)</b><br/>ہم نبی کریم ﷺ کے ساتھ رمضان کے دوسرے عشرہ میں اعتکاف میں بیٹھے ۔ پھر بیس تاریخ کی صبح کو آنحضرت ﷺ اعتکاف سے نکلے اور ہمیں خطبہ دیا آپ ﷺ نے فرمایا کہ مجھے لیلۃ القدر دکھائی گئی ، لیکن بھلا دی گئی یا ( آپ نے یہ فرمایا کہ ) میں خود بھول گیا ۔ اس لیے تم اسے آخری عشرہ ( کی طاق راتوں ) میں تلاش کرو ۔ میں نے ( خواب میں ) اپنے کو دیکھا کہ گویا میں کیچڑ"
  },

  {
    "title": "Kya 15 Shaban ko khaas taur se roza rkhna sunnat se sabit hai? ",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout. "
  },
  {
    "title": "Kya 15 Shaban ko kabristan me jaa kr candles/agarbattiyan Lgana sunnat se sabit hai",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah duniya ke akhri aasmaan pe aata hai aur logon ki farmata hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko khaas taur se zyada ibadat karne ka zyada sawaab hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ko khaas taur se halwa bnana aur sbko khilana sunnat se sabit hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya iss raat naama-e-amaal Allah k huzur pesh hote hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "What is innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Why is celebrating Shab-e-Baraat an innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  }
]
